HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_reg.h
/** \\brief  EC04, ATOM Channel Status Register */
#define GTM_ATOM3_CH7_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF010EC04u)

/** \\brief  F00C, TOM TGC0 Action Time Base Register */
#define GTM_ATOM4_AGC_ACT_TB /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ACT_TB*)0xF010F00Cu)

/** \\brief  F004, ATOM AGC Enable/Disable Control Register */
#define GTM_ATOM4_AGC_ENDIS_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_CTRL*)0xF010F004u)

/** \\brief  F008, ATOM AGC Enable/Disable Status Register */
#define GTM_ATOM4_AGC_ENDIS_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_STAT*)0xF010F008u)

/** \\brief  F018, ATOM AGC Force Update Control Register */
#define GTM_ATOM4_AGC_FUPD_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_FUPD_CTRL*)0xF010F018u)

/** \\brief  F000, ATOM AGC Global control register */
#define GTM_ATOM4_AGC_GLB_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_GLB_CTRL*)0xF010F000u)

/** \\brief  F01C, ATOM AGC Internal Trigger Control Register */
#define GTM_ATOM4_AGC_INT_TRIG /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_INT_TRIG*)0xF010F01Cu)

/** \\brief  F010, ATOM AGC Output Enable Control Register */
#define GTM_ATOM4_AGC_OUTEN_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_CTRL*)0xF010F010u)

/** \\brief  F014, ATOM AGC Output Enable Status Register */
#define GTM_ATOM4_AGC_OUTEN_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_STAT*)0xF010F014u)

/** \\brief  F090, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM4_CH0_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF010F090u)

/** \\brief  F098, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM4_CH0_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF010F098u)

/** \\brief  F08C, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM4_CH0_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF010F08Cu)

/** \\brief  F080, ATOM Channel Control Register */
#define GTM_ATOM4_CH0_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF010F080u)

/** \\brief  F0A4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM4_CH0_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF010F0A4u)

/** \\brief  F0A8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM4_CH0_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF010F0A8u)

/** \\brief  F0AC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM4_CH0_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF010F0ACu)

/** \\brief  F0A0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM4_CH0_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF010F0A0u)

/** \\brief  F088, ATOM Channel ARU Read Address Register */
#define GTM_ATOM4_CH0_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF010F088u)

/** \\brief  F094, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH0_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF010F094u)

/** \\brief  F09C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH0_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF010F09Cu)

/** \\brief  F084, ATOM Channel Status Register */
#define GTM_ATOM4_CH0_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF010F084u)

/** \\brief  F110, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM4_CH1_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF010F110u)

/** \\brief  F118, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM4_CH1_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF010F118u)

/** \\brief  F10C, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM4_CH1_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF010F10Cu)

/** \\brief  F100, ATOM Channel Control Register */
#define GTM_ATOM4_CH1_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF010F100u)

/** \\brief  F124, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM4_CH1_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF010F124u)

/** \\brief  F128, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM4_CH1_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF010F128u)

/** \\brief  F12C, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM4_CH1_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF010F12Cu)

/** \\brief  F120, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM4_CH1_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF010F120u)

/** \\brief  F108, ATOM Channel ARU Read Address Register */
#define GTM_ATOM4_CH1_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF010F108u)

/** \\brief  F114, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH1_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF010F114u)

/** \\brief  F11C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH1_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF010F11Cu)

/** \\brief  F104, ATOM Channel Status Register */
#define GTM_ATOM4_CH1_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF010F104u)

/** \\brief  F190, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM4_CH2_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF010F190u)

/** \\brief  F198, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM4_CH2_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF010F198u)

/** \\brief  F18C, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM4_CH2_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF010F18Cu)

/** \\brief  F180, ATOM Channel Control Register */
#define GTM_ATOM4_CH2_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF010F180u)

/** \\brief  F1A4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM4_CH2_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF010F1A4u)

/** \\brief  F1A8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM4_CH2_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF010F1A8u)

