HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_reg.h
/** \\brief  F1AC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM4_CH2_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF010F1ACu)

/** \\brief  F1A0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM4_CH2_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF010F1A0u)

/** \\brief  F188, ATOM Channel ARU Read Address Register */
#define GTM_ATOM4_CH2_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF010F188u)

/** \\brief  F194, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH2_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF010F194u)

/** \\brief  F19C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH2_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF010F19Cu)

/** \\brief  F184, ATOM Channel Status Register */
#define GTM_ATOM4_CH2_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF010F184u)

/** \\brief  F210, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM4_CH3_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF010F210u)

/** \\brief  F218, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM4_CH3_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF010F218u)

/** \\brief  F20C, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM4_CH3_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF010F20Cu)

/** \\brief  F200, ATOM Channel Control Register */
#define GTM_ATOM4_CH3_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF010F200u)

/** \\brief  F224, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM4_CH3_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF010F224u)

/** \\brief  F228, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM4_CH3_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF010F228u)

/** \\brief  F22C, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM4_CH3_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF010F22Cu)

/** \\brief  F220, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM4_CH3_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF010F220u)

/** \\brief  F208, ATOM Channel ARU Read Address Register */
#define GTM_ATOM4_CH3_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF010F208u)

/** \\brief  F214, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH3_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF010F214u)

/** \\brief  F21C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH3_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF010F21Cu)

/** \\brief  F204, ATOM Channel Status Register */
#define GTM_ATOM4_CH3_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF010F204u)

/** \\brief  F290, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM4_CH4_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF010F290u)

/** \\brief  F298, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM4_CH4_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF010F298u)

/** \\brief  F28C, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM4_CH4_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF010F28Cu)

/** \\brief  F280, ATOM Channel Control Register */
#define GTM_ATOM4_CH4_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF010F280u)

/** \\brief  F2A4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM4_CH4_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF010F2A4u)

/** \\brief  F2A8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM4_CH4_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF010F2A8u)

/** \\brief  F2AC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM4_CH4_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF010F2ACu)

/** \\brief  F2A0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM4_CH4_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF010F2A0u)

/** \\brief  F288, ATOM Channel ARU Read Address Register */
#define GTM_ATOM4_CH4_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF010F288u)

/** \\brief  F294, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH4_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF010F294u)

/** \\brief  F29C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH4_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF010F29Cu)

/** \\brief  F284, ATOM Channel Status Register */
#define GTM_ATOM4_CH4_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF010F284u)

/** \\brief  F310, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM4_CH5_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF010F310u)

/** \\brief  F318, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM4_CH5_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF010F318u)

/** \\brief  F30C, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM4_CH5_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF010F30Cu)

/** \\brief  F300, ATOM Channel Control Register */
#define GTM_ATOM4_CH5_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF010F300u)

/** \\brief  F324, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM4_CH5_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF010F324u)

/** \\brief  F328, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM4_CH5_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF010F328u)

/** \\brief  F32C, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM4_CH5_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF010F32Cu)

/** \\brief  F320, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM4_CH5_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF010F320u)

/** \\brief  F308, ATOM Channel ARU Read Address Register */
#define GTM_ATOM4_CH5_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF010F308u)

/** \\brief  F314, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH5_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF010F314u)

/** \\brief  F31C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH5_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF010F31Cu)

/** \\brief  F304, ATOM Channel Status Register */
#define GTM_ATOM4_CH5_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF010F304u)

/** \\brief  F390, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM4_CH6_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF010F390u)

/** \\brief  F398, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM4_CH6_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF010F398u)

/** \\brief  F38C, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM4_CH6_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF010F38Cu)

