HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_reg.h
/** \\brief  F380, ATOM Channel Control Register */
#define GTM_ATOM4_CH6_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF010F380u)

/** \\brief  F3A4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM4_CH6_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF010F3A4u)

/** \\brief  F3A8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM4_CH6_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF010F3A8u)

/** \\brief  F3AC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM4_CH6_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF010F3ACu)

/** \\brief  F3A0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM4_CH6_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF010F3A0u)

/** \\brief  F388, ATOM Channel ARU Read Address Register */
#define GTM_ATOM4_CH6_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF010F388u)

/** \\brief  F394, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH6_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF010F394u)

/** \\brief  F39C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH6_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF010F39Cu)

/** \\brief  F384, ATOM Channel Status Register */
#define GTM_ATOM4_CH6_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF010F384u)

/** \\brief  F410, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM4_CH7_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF010F410u)

/** \\brief  F418, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM4_CH7_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF010F418u)

/** \\brief  F40C, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM4_CH7_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF010F40Cu)

/** \\brief  F400, ATOM Channel Control Register */
#define GTM_ATOM4_CH7_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF010F400u)

/** \\brief  F424, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM4_CH7_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF010F424u)

/** \\brief  F428, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM4_CH7_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF010F428u)

/** \\brief  F42C, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM4_CH7_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF010F42Cu)

/** \\brief  F420, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM4_CH7_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF010F420u)

/** \\brief  F408, ATOM Channel ARU Read Address Register */
#define GTM_ATOM4_CH7_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF010F408u)

/** \\brief  F414, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH7_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF010F414u)

/** \\brief  F41C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH7_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF010F41Cu)

/** \\brief  F404, ATOM Channel Status Register */
#define GTM_ATOM4_CH7_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF010F404u)

/** \\brief  464, BRC Interrupt Enable Register */
#define GTM_BRC_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_IRQ_EN*)0xF0100464u)

/** \\brief  468, BRC_DEST_ERR Forcing Interrupt Register */
#define GTM_BRC_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_IRQ_FORCINT*)0xF0100468u)

/** \\brief  46C, BRC IRQ Mode Configuration Register */
#define GTM_BRC_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_IRQ_MODE*)0xF010046Cu)

/** \\brief  460, BRC Interrupt Notification Register */
#define GTM_BRC_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_IRQ_NOTIFY*)0xF0100460u)

/** \\brief  470, BRC Software Reset Register */
#define GTM_BRC_RST /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_RST*)0xF0100470u)

/** \\brief  400, Read Address For Input Channel */
#define GTM_BRC_SRC0_ADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_ADDR*)0xF0100400u)

/** \\brief  404, Destination Channels For Input Channel */
#define GTM_BRC_SRC0_DEST /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_DEST*)0xF0100404u)

/** \\brief  450, Read Address For Input Channel */
#define GTM_BRC_SRC10_ADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_ADDR*)0xF0100450u)

/** \\brief  454, Destination Channels For Input Channel */
#define GTM_BRC_SRC10_DEST /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_DEST*)0xF0100454u)

/** \\brief  458, Read Address For Input Channel */
#define GTM_BRC_SRC11_ADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_ADDR*)0xF0100458u)

/** \\brief  45C, Destination Channels For Input Channel */
#define GTM_BRC_SRC11_DEST /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_DEST*)0xF010045Cu)

/** \\brief  408, Read Address For Input Channel */
#define GTM_BRC_SRC1_ADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_ADDR*)0xF0100408u)

/** \\brief  40C, Destination Channels For Input Channel */
#define GTM_BRC_SRC1_DEST /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_DEST*)0xF010040Cu)

/** \\brief  410, Read Address For Input Channel */
#define GTM_BRC_SRC2_ADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_ADDR*)0xF0100410u)

/** \\brief  414, Destination Channels For Input Channel */
#define GTM_BRC_SRC2_DEST /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_DEST*)0xF0100414u)

/** \\brief  418, Read Address For Input Channel */
#define GTM_BRC_SRC3_ADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_ADDR*)0xF0100418u)

/** \\brief  41C, Destination Channels For Input Channel */
#define GTM_BRC_SRC3_DEST /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_DEST*)0xF010041Cu)

/** \\brief  420, Read Address For Input Channel */
#define GTM_BRC_SRC4_ADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_ADDR*)0xF0100420u)

/** \\brief  424, Destination Channels For Input Channel */
#define GTM_BRC_SRC4_DEST /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_DEST*)0xF0100424u)

/** \\brief  428, Read Address For Input Channel */
#define GTM_BRC_SRC5_ADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_ADDR*)0xF0100428u)

