HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_DPLL_PSAC13.
* To use register names with standard convension, please use GTM_DPLL_PSAC13.
*/
#define	GTM_DPLL_PSAC_13	(GTM_DPLL_PSAC13)

/** \\brief  28198, Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC14 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC*)0xF0128198u)

/** Alias (User Manual Name) for GTM_DPLL_PSAC14.
* To use register names with standard convension, please use GTM_DPLL_PSAC14.
*/
#define	GTM_DPLL_PSAC_14	(GTM_DPLL_PSAC14)

/** \\brief  2819C, Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC15 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC*)0xF012819Cu)

/** Alias (User Manual Name) for GTM_DPLL_PSAC15.
* To use register names with standard convension, please use GTM_DPLL_PSAC15.
*/
#define	GTM_DPLL_PSAC_15	(GTM_DPLL_PSAC15)

/** \\brief  281A0, Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC16 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC*)0xF01281A0u)

/** Alias (User Manual Name) for GTM_DPLL_PSAC16.
* To use register names with standard convension, please use GTM_DPLL_PSAC16.
*/
#define	GTM_DPLL_PSAC_16	(GTM_DPLL_PSAC16)

/** \\brief  281A4, Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC17 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC*)0xF01281A4u)

/** Alias (User Manual Name) for GTM_DPLL_PSAC17.
* To use register names with standard convension, please use GTM_DPLL_PSAC17.
*/
#define	GTM_DPLL_PSAC_17	(GTM_DPLL_PSAC17)

/** \\brief  281A8, Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC18 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC*)0xF01281A8u)

/** Alias (User Manual Name) for GTM_DPLL_PSAC18.
* To use register names with standard convension, please use GTM_DPLL_PSAC18.
*/
#define	GTM_DPLL_PSAC_18	(GTM_DPLL_PSAC18)

/** \\brief  281AC, Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC19 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC*)0xF01281ACu)

/** Alias (User Manual Name) for GTM_DPLL_PSAC19.
* To use register names with standard convension, please use GTM_DPLL_PSAC19.
*/
#define	GTM_DPLL_PSAC_19	(GTM_DPLL_PSAC19)

/** \\brief  28168, Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC*)0xF0128168u)

/** Alias (User Manual Name) for GTM_DPLL_PSAC2.
* To use register names with standard convension, please use GTM_DPLL_PSAC2.
*/
#define	GTM_DPLL_PSAC_2	(GTM_DPLL_PSAC2)

/** \\brief  281B0, Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC20 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC*)0xF01281B0u)

/** Alias (User Manual Name) for GTM_DPLL_PSAC20.
* To use register names with standard convension, please use GTM_DPLL_PSAC20.
*/
#define	GTM_DPLL_PSAC_20	(GTM_DPLL_PSAC20)

/** \\brief  281B4, Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC21 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC*)0xF01281B4u)

/** Alias (User Manual Name) for GTM_DPLL_PSAC21.
* To use register names with standard convension, please use GTM_DPLL_PSAC21.
*/
#define	GTM_DPLL_PSAC_21	(GTM_DPLL_PSAC21)

/** \\brief  281B8, Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC22 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC*)0xF01281B8u)

/** Alias (User Manual Name) for GTM_DPLL_PSAC22.
* To use register names with standard convension, please use GTM_DPLL_PSAC22.
*/
#define	GTM_DPLL_PSAC_22	(GTM_DPLL_PSAC22)

/** \\brief  281BC, Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC23 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC*)0xF01281BCu)

/** Alias (User Manual Name) for GTM_DPLL_PSAC23.
* To use register names with standard convension, please use GTM_DPLL_PSAC23.
*/
#define	GTM_DPLL_PSAC_23	(GTM_DPLL_PSAC23)

/** \\brief  2816C, Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC3 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC*)0xF012816Cu)

/** Alias (User Manual Name) for GTM_DPLL_PSAC3.
* To use register names with standard convension, please use GTM_DPLL_PSAC3.
*/
#define	GTM_DPLL_PSAC_3	(GTM_DPLL_PSAC3)

/** \\brief  28170, Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC4 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC*)0xF0128170u)

/** Alias (User Manual Name) for GTM_DPLL_PSAC4.
* To use register names with standard convension, please use GTM_DPLL_PSAC4.
*/
#define	GTM_DPLL_PSAC_4	(GTM_DPLL_PSAC4)

/** \\brief  28174, Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC5 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC*)0xF0128174u)

/** Alias (User Manual Name) for GTM_DPLL_PSAC5.
* To use register names with standard convension, please use GTM_DPLL_PSAC5.
*/
#define	GTM_DPLL_PSAC_5	(GTM_DPLL_PSAC5)

/** \\brief  28178, Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC6 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC*)0xF0128178u)

/** Alias (User Manual Name) for GTM_DPLL_PSAC6.
* To use register names with standard convension, please use GTM_DPLL_PSAC6.
*/
#define	GTM_DPLL_PSAC_6	(GTM_DPLL_PSAC6)

/** \\brief  2817C, Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC7 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC*)0xF012817Cu)

/** Alias (User Manual Name) for GTM_DPLL_PSAC7.
* To use register names with standard convension, please use GTM_DPLL_PSAC7.
*/
#define	GTM_DPLL_PSAC_7	(GTM_DPLL_PSAC7)

/** \\brief  28180, Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC8 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC*)0xF0128180u)

/** Alias (User Manual Name) for GTM_DPLL_PSAC8.
* To use register names with standard convension, please use GTM_DPLL_PSAC8.
*/
#define	GTM_DPLL_PSAC_8	(GTM_DPLL_PSAC8)

/** \\brief  28184, Calculated Position Value for ACTION_i Register */
#define GTM_DPLL_PSAC9 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC*)0xF0128184u)

/** Alias (User Manual Name) for GTM_DPLL_PSAC9.
* To use register names with standard convension, please use GTM_DPLL_PSAC9.
*/
#define	GTM_DPLL_PSAC_9	(GTM_DPLL_PSAC9)

/** \\brief  281FC, DPLL RAM Initatlisation Register */
#define GTM_DPLL_RAM_INI /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RAM_INI*)0xF01281FCu)

/** \\brief  28014, DPLL Status Register */
#define GTM_DPLL_STATUS /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_STATUS*)0xF0128014u)

/** \\brief  280C4, DPLL TBU_TS0 Value at last STATE Event */
#define GTM_DPLL_TBU_TS0_S /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TBU_TS0_S*)0xF01280C4u)

