HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_DPLL_TBU_TS0_S.
* To use register names with standard convension, please use GTM_DPLL_TBU_TS0_S.
*/
#define	GTM_TBU_TS0_S	(GTM_DPLL_TBU_TS0_S)

/** \\brief  280C0, DPLL TBU_TS0 Value at last TRIGGER Event */
#define GTM_DPLL_TBU_TS0_T /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TBU_TS0_T*)0xF01280C0u)

/** Alias (User Manual Name) for GTM_DPLL_TBU_TS0_T.
* To use register names with standard convension, please use GTM_DPLL_TBU_TS0_T.
*/
#define	GTM_TBU_TS0_T	(GTM_DPLL_TBU_TS0_T)

/** \\brief  28100, Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA0 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSA*)0xF0128100u)

/** Alias (User Manual Name) for GTM_DPLL_TSA0.
* To use register names with standard convension, please use GTM_DPLL_TSA0.
*/
#define	GTM_DPLL_TSA_0	(GTM_DPLL_TSA0)

/** \\brief  28104, Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA1 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSA*)0xF0128104u)

/** Alias (User Manual Name) for GTM_DPLL_TSA1.
* To use register names with standard convension, please use GTM_DPLL_TSA1.
*/
#define	GTM_DPLL_TSA_1	(GTM_DPLL_TSA1)

/** \\brief  28128, Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA10 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSA*)0xF0128128u)

/** Alias (User Manual Name) for GTM_DPLL_TSA10.
* To use register names with standard convension, please use GTM_DPLL_TSA10.
*/
#define	GTM_DPLL_TSA_10	(GTM_DPLL_TSA10)

/** \\brief  2812C, Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA11 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSA*)0xF012812Cu)

/** Alias (User Manual Name) for GTM_DPLL_TSA11.
* To use register names with standard convension, please use GTM_DPLL_TSA11.
*/
#define	GTM_DPLL_TSA_11	(GTM_DPLL_TSA11)

/** \\brief  28130, Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA12 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSA*)0xF0128130u)

/** Alias (User Manual Name) for GTM_DPLL_TSA12.
* To use register names with standard convension, please use GTM_DPLL_TSA12.
*/
#define	GTM_DPLL_TSA_12	(GTM_DPLL_TSA12)

/** \\brief  28134, Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA13 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSA*)0xF0128134u)

/** Alias (User Manual Name) for GTM_DPLL_TSA13.
* To use register names with standard convension, please use GTM_DPLL_TSA13.
*/
#define	GTM_DPLL_TSA_13	(GTM_DPLL_TSA13)

/** \\brief  28138, Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA14 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSA*)0xF0128138u)

/** Alias (User Manual Name) for GTM_DPLL_TSA14.
* To use register names with standard convension, please use GTM_DPLL_TSA14.
*/
#define	GTM_DPLL_TSA_14	(GTM_DPLL_TSA14)

/** \\brief  2813C, Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA15 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSA*)0xF012813Cu)

/** Alias (User Manual Name) for GTM_DPLL_TSA15.
* To use register names with standard convension, please use GTM_DPLL_TSA15.
*/
#define	GTM_DPLL_TSA_15	(GTM_DPLL_TSA15)

/** \\brief  28140, Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA16 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSA*)0xF0128140u)

/** Alias (User Manual Name) for GTM_DPLL_TSA16.
* To use register names with standard convension, please use GTM_DPLL_TSA16.
*/
#define	GTM_DPLL_TSA_16	(GTM_DPLL_TSA16)

/** \\brief  28144, Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA17 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSA*)0xF0128144u)

/** Alias (User Manual Name) for GTM_DPLL_TSA17.
* To use register names with standard convension, please use GTM_DPLL_TSA17.
*/
#define	GTM_DPLL_TSA_17	(GTM_DPLL_TSA17)

/** \\brief  28148, Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA18 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSA*)0xF0128148u)

/** Alias (User Manual Name) for GTM_DPLL_TSA18.
* To use register names with standard convension, please use GTM_DPLL_TSA18.
*/
#define	GTM_DPLL_TSA_18	(GTM_DPLL_TSA18)

/** \\brief  2814C, Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA19 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSA*)0xF012814Cu)

/** Alias (User Manual Name) for GTM_DPLL_TSA19.
* To use register names with standard convension, please use GTM_DPLL_TSA19.
*/
#define	GTM_DPLL_TSA_19	(GTM_DPLL_TSA19)

/** \\brief  28108, Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSA*)0xF0128108u)

/** Alias (User Manual Name) for GTM_DPLL_TSA2.
* To use register names with standard convension, please use GTM_DPLL_TSA2.
*/
#define	GTM_DPLL_TSA_2	(GTM_DPLL_TSA2)

/** \\brief  28150, Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA20 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSA*)0xF0128150u)

/** Alias (User Manual Name) for GTM_DPLL_TSA20.
* To use register names with standard convension, please use GTM_DPLL_TSA20.
*/
#define	GTM_DPLL_TSA_20	(GTM_DPLL_TSA20)

/** \\brief  28154, Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA21 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSA*)0xF0128154u)

/** Alias (User Manual Name) for GTM_DPLL_TSA21.
* To use register names with standard convension, please use GTM_DPLL_TSA21.
*/
#define	GTM_DPLL_TSA_21	(GTM_DPLL_TSA21)

/** \\brief  28158, Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA22 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSA*)0xF0128158u)

/** Alias (User Manual Name) for GTM_DPLL_TSA22.
* To use register names with standard convension, please use GTM_DPLL_TSA22.
*/
#define	GTM_DPLL_TSA_22	(GTM_DPLL_TSA22)

/** \\brief  2815C, Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA23 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSA*)0xF012815Cu)

/** Alias (User Manual Name) for GTM_DPLL_TSA23.
* To use register names with standard convension, please use GTM_DPLL_TSA23.
*/
#define	GTM_DPLL_TSA_23	(GTM_DPLL_TSA23)

/** \\brief  2810C, Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA3 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSA*)0xF012810Cu)

/** Alias (User Manual Name) for GTM_DPLL_TSA3.
* To use register names with standard convension, please use GTM_DPLL_TSA3.
*/
#define	GTM_DPLL_TSA_3	(GTM_DPLL_TSA3)

/** \\brief  28110, Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA4 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSA*)0xF0128110u)

/** Alias (User Manual Name) for GTM_DPLL_TSA4.
* To use register names with standard convension, please use GTM_DPLL_TSA4.
*/
#define	GTM_DPLL_TSA_4	(GTM_DPLL_TSA4)

/** \\brief  28114, Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA5 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSA*)0xF0128114u)

/** Alias (User Manual Name) for GTM_DPLL_TSA5.
* To use register names with standard convension, please use GTM_DPLL_TSA5.
*/
#define	GTM_DPLL_TSA_5	(GTM_DPLL_TSA5)

/** \\brief  28118, Calculated Time Stamp For ACTION_i Register */
#define GTM_DPLL_TSA6 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSA*)0xF0128118u)

