HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_reg.h
/** \\brief  184B4, FIFO0 Channel Status Register */
#define GTM_FIFO0_CH5_STATUS /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS*)0xF01184B4u)

/** \\brief  184AC, FIFO0 Channel Upper Watermark Register */
#define GTM_FIFO0_CH5_UPPER_WM /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM*)0xF01184ACu)

/** \\brief  184C0, FIFO0 Channel Control Register */
#define GTM_FIFO0_CH6_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_CTRL*)0xF01184C0u)

/** \\brief  184C4, FIFO0 Channel End Address Register */
#define GTM_FIFO0_CH6_END_ADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_END_ADDR*)0xF01184C4u)

/** \\brief  184D8, FIFO0 Channel Fill Level Register */
#define GTM_FIFO0_CH6_FILL_LEVEL /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_FILL_LEVEL*)0xF01184D8u)

/** \\brief  184D0, FIFO0 Channel Lower Watermark Register */
#define GTM_FIFO0_CH6_LOWER_WM /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_LOWER_WM*)0xF01184D0u)

/** \\brief  184C8, FIFO0 Channel Start Address Register */
#define GTM_FIFO0_CH6_START_ADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_START_ADDR*)0xF01184C8u)

/** \\brief  184D4, FIFO0 Channel Status Register */
#define GTM_FIFO0_CH6_STATUS /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS*)0xF01184D4u)

/** \\brief  184CC, FIFO0 Channel Upper Watermark Register */
#define GTM_FIFO0_CH6_UPPER_WM /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM*)0xF01184CCu)

/** \\brief  184E0, FIFO0 Channel Control Register */
#define GTM_FIFO0_CH7_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_CTRL*)0xF01184E0u)

/** \\brief  184E4, FIFO0 Channel End Address Register */
#define GTM_FIFO0_CH7_END_ADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_END_ADDR*)0xF01184E4u)

/** \\brief  184F8, FIFO0 Channel Fill Level Register */
#define GTM_FIFO0_CH7_FILL_LEVEL /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_FILL_LEVEL*)0xF01184F8u)

/** \\brief  184F0, FIFO0 Channel Lower Watermark Register */
#define GTM_FIFO0_CH7_LOWER_WM /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_LOWER_WM*)0xF01184F0u)

/** \\brief  184E8, FIFO0 Channel Start Address Register */
#define GTM_FIFO0_CH7_START_ADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_START_ADDR*)0xF01184E8u)

/** \\brief  184F4, FIFO0 Channel Status Register */
#define GTM_FIFO0_CH7_STATUS /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS*)0xF01184F4u)

/** \\brief  184EC, FIFO0 Channel Upper Watermark Register */
#define GTM_FIFO0_CH7_UPPER_WM /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM*)0xF01184ECu)

/** \\brief  18604, FIFO0 Channel Interrupt Enable Register */
#define GTM_FIFO0_CH_IRQ0_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_IRQ_EN*)0xF0118604u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_IRQ0_IRQ_EN.
* To use register names with standard convension, please use GTM_FIFO0_CH_IRQ0_IRQ_EN.
*/
#define	GTM_FIFO0_CH0_IRQ_EN	(GTM_FIFO0_CH_IRQ0_IRQ_EN)

/** \\brief  18608, FIFO0 Channel Force Interrupt By Software Register */
#define GTM_FIFO0_CH_IRQ0_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_IRQ_FORCINT*)0xF0118608u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_IRQ0_IRQ_FORCINT.
* To use register names with standard convension, please use GTM_FIFO0_CH_IRQ0_IRQ_FORCINT.
*/
#define	GTM_FIFO0_CH0_IRQ_FORCINT	(GTM_FIFO0_CH_IRQ0_IRQ_FORCINT)

/** \\brief  1860C, FIFO0 Channel IRQ Mode Control Register */
#define GTM_FIFO0_CH_IRQ0_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_IRQ_MODE*)0xF011860Cu)

/** Alias (User Manual Name) for GTM_FIFO0_CH_IRQ0_IRQ_MODE.
* To use register names with standard convension, please use GTM_FIFO0_CH_IRQ0_IRQ_MODE.
*/
#define	GTM_FIFO0_CH0_IRQ_MODE	(GTM_FIFO0_CH_IRQ0_IRQ_MODE)

/** \\brief  18600, FIFO0 Channel Interrupt Notification Register */
#define GTM_FIFO0_CH_IRQ0_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_IRQ_NOTIFY*)0xF0118600u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_IRQ0_IRQ_NOTIFY.
* To use register names with standard convension, please use GTM_FIFO0_CH_IRQ0_IRQ_NOTIFY.
*/
#define	GTM_FIFO0_CH0_IRQ_NOTIFY	(GTM_FIFO0_CH_IRQ0_IRQ_NOTIFY)

/** \\brief  18624, FIFO0 Channel Interrupt Enable Register */
#define GTM_FIFO0_CH_IRQ1_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_IRQ_EN*)0xF0118624u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_IRQ1_IRQ_EN.
* To use register names with standard convension, please use GTM_FIFO0_CH_IRQ1_IRQ_EN.
*/
#define	GTM_FIFO0_CH1_IRQ_EN	(GTM_FIFO0_CH_IRQ1_IRQ_EN)

/** \\brief  18628, FIFO0 Channel Force Interrupt By Software Register */
#define GTM_FIFO0_CH_IRQ1_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_IRQ_FORCINT*)0xF0118628u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_IRQ1_IRQ_FORCINT.
* To use register names with standard convension, please use GTM_FIFO0_CH_IRQ1_IRQ_FORCINT.
*/
#define	GTM_FIFO0_CH1_IRQ_FORCINT	(GTM_FIFO0_CH_IRQ1_IRQ_FORCINT)

/** \\brief  1862C, FIFO0 Channel IRQ Mode Control Register */
#define GTM_FIFO0_CH_IRQ1_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_IRQ_MODE*)0xF011862Cu)

/** Alias (User Manual Name) for GTM_FIFO0_CH_IRQ1_IRQ_MODE.
* To use register names with standard convension, please use GTM_FIFO0_CH_IRQ1_IRQ_MODE.
*/
#define	GTM_FIFO0_CH1_IRQ_MODE	(GTM_FIFO0_CH_IRQ1_IRQ_MODE)

/** \\brief  18620, FIFO0 Channel Interrupt Notification Register */
#define GTM_FIFO0_CH_IRQ1_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_IRQ_NOTIFY*)0xF0118620u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_IRQ1_IRQ_NOTIFY.
* To use register names with standard convension, please use GTM_FIFO0_CH_IRQ1_IRQ_NOTIFY.
*/
#define	GTM_FIFO0_CH1_IRQ_NOTIFY	(GTM_FIFO0_CH_IRQ1_IRQ_NOTIFY)

/** \\brief  18644, FIFO0 Channel Interrupt Enable Register */
#define GTM_FIFO0_CH_IRQ2_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_IRQ_EN*)0xF0118644u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_IRQ2_IRQ_EN.
* To use register names with standard convension, please use GTM_FIFO0_CH_IRQ2_IRQ_EN.
*/
#define	GTM_FIFO0_CH2_IRQ_EN	(GTM_FIFO0_CH_IRQ2_IRQ_EN)

/** \\brief  18648, FIFO0 Channel Force Interrupt By Software Register */
#define GTM_FIFO0_CH_IRQ2_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_IRQ_FORCINT*)0xF0118648u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_IRQ2_IRQ_FORCINT.
* To use register names with standard convension, please use GTM_FIFO0_CH_IRQ2_IRQ_FORCINT.
*/
#define	GTM_FIFO0_CH2_IRQ_FORCINT	(GTM_FIFO0_CH_IRQ2_IRQ_FORCINT)

/** \\brief  1864C, FIFO0 Channel IRQ Mode Control Register */
#define GTM_FIFO0_CH_IRQ2_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_IRQ_MODE*)0xF011864Cu)

