HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_FIFO0_CH_IRQ2_IRQ_MODE.
* To use register names with standard convension, please use GTM_FIFO0_CH_IRQ2_IRQ_MODE.
*/
#define	GTM_FIFO0_CH2_IRQ_MODE	(GTM_FIFO0_CH_IRQ2_IRQ_MODE)

/** \\brief  18640, FIFO0 Channel Interrupt Notification Register */
#define GTM_FIFO0_CH_IRQ2_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_IRQ_NOTIFY*)0xF0118640u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_IRQ2_IRQ_NOTIFY.
* To use register names with standard convension, please use GTM_FIFO0_CH_IRQ2_IRQ_NOTIFY.
*/
#define	GTM_FIFO0_CH2_IRQ_NOTIFY	(GTM_FIFO0_CH_IRQ2_IRQ_NOTIFY)

/** \\brief  18664, FIFO0 Channel Interrupt Enable Register */
#define GTM_FIFO0_CH_IRQ3_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_IRQ_EN*)0xF0118664u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_IRQ3_IRQ_EN.
* To use register names with standard convension, please use GTM_FIFO0_CH_IRQ3_IRQ_EN.
*/
#define	GTM_FIFO0_CH3_IRQ_EN	(GTM_FIFO0_CH_IRQ3_IRQ_EN)

/** \\brief  18668, FIFO0 Channel Force Interrupt By Software Register */
#define GTM_FIFO0_CH_IRQ3_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_IRQ_FORCINT*)0xF0118668u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_IRQ3_IRQ_FORCINT.
* To use register names with standard convension, please use GTM_FIFO0_CH_IRQ3_IRQ_FORCINT.
*/
#define	GTM_FIFO0_CH3_IRQ_FORCINT	(GTM_FIFO0_CH_IRQ3_IRQ_FORCINT)

/** \\brief  1866C, FIFO0 Channel IRQ Mode Control Register */
#define GTM_FIFO0_CH_IRQ3_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_IRQ_MODE*)0xF011866Cu)

/** Alias (User Manual Name) for GTM_FIFO0_CH_IRQ3_IRQ_MODE.
* To use register names with standard convension, please use GTM_FIFO0_CH_IRQ3_IRQ_MODE.
*/
#define	GTM_FIFO0_CH3_IRQ_MODE	(GTM_FIFO0_CH_IRQ3_IRQ_MODE)

/** \\brief  18660, FIFO0 Channel Interrupt Notification Register */
#define GTM_FIFO0_CH_IRQ3_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_IRQ_NOTIFY*)0xF0118660u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_IRQ3_IRQ_NOTIFY.
* To use register names with standard convension, please use GTM_FIFO0_CH_IRQ3_IRQ_NOTIFY.
*/
#define	GTM_FIFO0_CH3_IRQ_NOTIFY	(GTM_FIFO0_CH_IRQ3_IRQ_NOTIFY)

/** \\brief  18684, FIFO0 Channel Interrupt Enable Register */
#define GTM_FIFO0_CH_IRQ4_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_IRQ_EN*)0xF0118684u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_IRQ4_IRQ_EN.
* To use register names with standard convension, please use GTM_FIFO0_CH_IRQ4_IRQ_EN.
*/
#define	GTM_FIFO0_CH4_IRQ_EN	(GTM_FIFO0_CH_IRQ4_IRQ_EN)

/** \\brief  18688, FIFO0 Channel Force Interrupt By Software Register */
#define GTM_FIFO0_CH_IRQ4_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_IRQ_FORCINT*)0xF0118688u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_IRQ4_IRQ_FORCINT.
* To use register names with standard convension, please use GTM_FIFO0_CH_IRQ4_IRQ_FORCINT.
*/
#define	GTM_FIFO0_CH4_IRQ_FORCINT	(GTM_FIFO0_CH_IRQ4_IRQ_FORCINT)

/** \\brief  1868C, FIFO0 Channel IRQ Mode Control Register */
#define GTM_FIFO0_CH_IRQ4_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_IRQ_MODE*)0xF011868Cu)

/** Alias (User Manual Name) for GTM_FIFO0_CH_IRQ4_IRQ_MODE.
* To use register names with standard convension, please use GTM_FIFO0_CH_IRQ4_IRQ_MODE.
*/
#define	GTM_FIFO0_CH4_IRQ_MODE	(GTM_FIFO0_CH_IRQ4_IRQ_MODE)

/** \\brief  18680, FIFO0 Channel Interrupt Notification Register */
#define GTM_FIFO0_CH_IRQ4_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_IRQ_NOTIFY*)0xF0118680u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_IRQ4_IRQ_NOTIFY.
* To use register names with standard convension, please use GTM_FIFO0_CH_IRQ4_IRQ_NOTIFY.
*/
#define	GTM_FIFO0_CH4_IRQ_NOTIFY	(GTM_FIFO0_CH_IRQ4_IRQ_NOTIFY)

/** \\brief  186A4, FIFO0 Channel Interrupt Enable Register */
#define GTM_FIFO0_CH_IRQ5_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_IRQ_EN*)0xF01186A4u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_IRQ5_IRQ_EN.
* To use register names with standard convension, please use GTM_FIFO0_CH_IRQ5_IRQ_EN.
*/
#define	GTM_FIFO0_CH5_IRQ_EN	(GTM_FIFO0_CH_IRQ5_IRQ_EN)

/** \\brief  186A8, FIFO0 Channel Force Interrupt By Software Register */
#define GTM_FIFO0_CH_IRQ5_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_IRQ_FORCINT*)0xF01186A8u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_IRQ5_IRQ_FORCINT.
* To use register names with standard convension, please use GTM_FIFO0_CH_IRQ5_IRQ_FORCINT.
*/
#define	GTM_FIFO0_CH5_IRQ_FORCINT	(GTM_FIFO0_CH_IRQ5_IRQ_FORCINT)

/** \\brief  186AC, FIFO0 Channel IRQ Mode Control Register */
#define GTM_FIFO0_CH_IRQ5_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_IRQ_MODE*)0xF01186ACu)

/** Alias (User Manual Name) for GTM_FIFO0_CH_IRQ5_IRQ_MODE.
* To use register names with standard convension, please use GTM_FIFO0_CH_IRQ5_IRQ_MODE.
*/
#define	GTM_FIFO0_CH5_IRQ_MODE	(GTM_FIFO0_CH_IRQ5_IRQ_MODE)

/** \\brief  186A0, FIFO0 Channel Interrupt Notification Register */
#define GTM_FIFO0_CH_IRQ5_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_IRQ_NOTIFY*)0xF01186A0u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_IRQ5_IRQ_NOTIFY.
* To use register names with standard convension, please use GTM_FIFO0_CH_IRQ5_IRQ_NOTIFY.
*/
#define	GTM_FIFO0_CH5_IRQ_NOTIFY	(GTM_FIFO0_CH_IRQ5_IRQ_NOTIFY)

/** \\brief  186C4, FIFO0 Channel Interrupt Enable Register */
#define GTM_FIFO0_CH_IRQ6_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_IRQ_EN*)0xF01186C4u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_IRQ6_IRQ_EN.
* To use register names with standard convension, please use GTM_FIFO0_CH_IRQ6_IRQ_EN.
*/
#define	GTM_FIFO0_CH6_IRQ_EN	(GTM_FIFO0_CH_IRQ6_IRQ_EN)

/** \\brief  186C8, FIFO0 Channel Force Interrupt By Software Register */
#define GTM_FIFO0_CH_IRQ6_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_IRQ_FORCINT*)0xF01186C8u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_IRQ6_IRQ_FORCINT.
* To use register names with standard convension, please use GTM_FIFO0_CH_IRQ6_IRQ_FORCINT.
*/
#define	GTM_FIFO0_CH6_IRQ_FORCINT	(GTM_FIFO0_CH_IRQ6_IRQ_FORCINT)

