HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_reg.h
/** \\brief  186CC, FIFO0 Channel IRQ Mode Control Register */
#define GTM_FIFO0_CH_IRQ6_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_IRQ_MODE*)0xF01186CCu)

/** Alias (User Manual Name) for GTM_FIFO0_CH_IRQ6_IRQ_MODE.
* To use register names with standard convension, please use GTM_FIFO0_CH_IRQ6_IRQ_MODE.
*/
#define	GTM_FIFO0_CH6_IRQ_MODE	(GTM_FIFO0_CH_IRQ6_IRQ_MODE)

/** \\brief  186C0, FIFO0 Channel Interrupt Notification Register */
#define GTM_FIFO0_CH_IRQ6_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_IRQ_NOTIFY*)0xF01186C0u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_IRQ6_IRQ_NOTIFY.
* To use register names with standard convension, please use GTM_FIFO0_CH_IRQ6_IRQ_NOTIFY.
*/
#define	GTM_FIFO0_CH6_IRQ_NOTIFY	(GTM_FIFO0_CH_IRQ6_IRQ_NOTIFY)

/** \\brief  186E4, FIFO0 Channel Interrupt Enable Register */
#define GTM_FIFO0_CH_IRQ7_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_IRQ_EN*)0xF01186E4u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_IRQ7_IRQ_EN.
* To use register names with standard convension, please use GTM_FIFO0_CH_IRQ7_IRQ_EN.
*/
#define	GTM_FIFO0_CH7_IRQ_EN	(GTM_FIFO0_CH_IRQ7_IRQ_EN)

/** \\brief  186E8, FIFO0 Channel Force Interrupt By Software Register */
#define GTM_FIFO0_CH_IRQ7_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_IRQ_FORCINT*)0xF01186E8u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_IRQ7_IRQ_FORCINT.
* To use register names with standard convension, please use GTM_FIFO0_CH_IRQ7_IRQ_FORCINT.
*/
#define	GTM_FIFO0_CH7_IRQ_FORCINT	(GTM_FIFO0_CH_IRQ7_IRQ_FORCINT)

/** \\brief  186EC, FIFO0 Channel IRQ Mode Control Register */
#define GTM_FIFO0_CH_IRQ7_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_IRQ_MODE*)0xF01186ECu)

/** Alias (User Manual Name) for GTM_FIFO0_CH_IRQ7_IRQ_MODE.
* To use register names with standard convension, please use GTM_FIFO0_CH_IRQ7_IRQ_MODE.
*/
#define	GTM_FIFO0_CH7_IRQ_MODE	(GTM_FIFO0_CH_IRQ7_IRQ_MODE)

/** \\brief  186E0, FIFO0 Channel Interrupt Notification Register */
#define GTM_FIFO0_CH_IRQ7_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_IRQ_NOTIFY*)0xF01186E0u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_IRQ7_IRQ_NOTIFY.
* To use register names with standard convension, please use GTM_FIFO0_CH_IRQ7_IRQ_NOTIFY.
*/
#define	GTM_FIFO0_CH7_IRQ_NOTIFY	(GTM_FIFO0_CH_IRQ7_IRQ_NOTIFY)

/** \\brief  18504, FIFO0 Channel Read Pointer Register */
#define GTM_FIFO0_CH_PTR0_RD_PTR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_PTR_RD_PTR*)0xF0118504u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_PTR0_RD_PTR.
* To use register names with standard convension, please use GTM_FIFO0_CH_PTR0_RD_PTR.
*/
#define	GTM_FIFO0_CH0_RD_PTR	(GTM_FIFO0_CH_PTR0_RD_PTR)

/** \\brief  18500, FIFO0 Channel Write Pointer Register */
#define GTM_FIFO0_CH_PTR0_WR_PTR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_PTR_WR_PTR*)0xF0118500u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_PTR0_WR_PTR.
* To use register names with standard convension, please use GTM_FIFO0_CH_PTR0_WR_PTR.
*/
#define	GTM_FIFO0_CH0_WR_PTR	(GTM_FIFO0_CH_PTR0_WR_PTR)

/** \\brief  18524, FIFO0 Channel Read Pointer Register */
#define GTM_FIFO0_CH_PTR1_RD_PTR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_PTR_RD_PTR*)0xF0118524u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_PTR1_RD_PTR.
* To use register names with standard convension, please use GTM_FIFO0_CH_PTR1_RD_PTR.
*/
#define	GTM_FIFO0_CH1_RD_PTR	(GTM_FIFO0_CH_PTR1_RD_PTR)

/** \\brief  18520, FIFO0 Channel Write Pointer Register */
#define GTM_FIFO0_CH_PTR1_WR_PTR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_PTR_WR_PTR*)0xF0118520u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_PTR1_WR_PTR.
* To use register names with standard convension, please use GTM_FIFO0_CH_PTR1_WR_PTR.
*/
#define	GTM_FIFO0_CH1_WR_PTR	(GTM_FIFO0_CH_PTR1_WR_PTR)

/** \\brief  18544, FIFO0 Channel Read Pointer Register */
#define GTM_FIFO0_CH_PTR2_RD_PTR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_PTR_RD_PTR*)0xF0118544u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_PTR2_RD_PTR.
* To use register names with standard convension, please use GTM_FIFO0_CH_PTR2_RD_PTR.
*/
#define	GTM_FIFO0_CH2_RD_PTR	(GTM_FIFO0_CH_PTR2_RD_PTR)

/** \\brief  18540, FIFO0 Channel Write Pointer Register */
#define GTM_FIFO0_CH_PTR2_WR_PTR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_PTR_WR_PTR*)0xF0118540u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_PTR2_WR_PTR.
* To use register names with standard convension, please use GTM_FIFO0_CH_PTR2_WR_PTR.
*/
#define	GTM_FIFO0_CH2_WR_PTR	(GTM_FIFO0_CH_PTR2_WR_PTR)

/** \\brief  18564, FIFO0 Channel Read Pointer Register */
#define GTM_FIFO0_CH_PTR3_RD_PTR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_PTR_RD_PTR*)0xF0118564u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_PTR3_RD_PTR.
* To use register names with standard convension, please use GTM_FIFO0_CH_PTR3_RD_PTR.
*/
#define	GTM_FIFO0_CH3_RD_PTR	(GTM_FIFO0_CH_PTR3_RD_PTR)

/** \\brief  18560, FIFO0 Channel Write Pointer Register */
#define GTM_FIFO0_CH_PTR3_WR_PTR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_PTR_WR_PTR*)0xF0118560u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_PTR3_WR_PTR.
* To use register names with standard convension, please use GTM_FIFO0_CH_PTR3_WR_PTR.
*/
#define	GTM_FIFO0_CH3_WR_PTR	(GTM_FIFO0_CH_PTR3_WR_PTR)

/** \\brief  18584, FIFO0 Channel Read Pointer Register */
#define GTM_FIFO0_CH_PTR4_RD_PTR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_PTR_RD_PTR*)0xF0118584u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_PTR4_RD_PTR.
* To use register names with standard convension, please use GTM_FIFO0_CH_PTR4_RD_PTR.
*/
#define	GTM_FIFO0_CH4_RD_PTR	(GTM_FIFO0_CH_PTR4_RD_PTR)

/** \\brief  18580, FIFO0 Channel Write Pointer Register */
#define GTM_FIFO0_CH_PTR4_WR_PTR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_PTR_WR_PTR*)0xF0118580u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_PTR4_WR_PTR.
* To use register names with standard convension, please use GTM_FIFO0_CH_PTR4_WR_PTR.
*/
#define	GTM_FIFO0_CH4_WR_PTR	(GTM_FIFO0_CH_PTR4_WR_PTR)

