HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_reg.h
/** \\brief  185A4, FIFO0 Channel Read Pointer Register */
#define GTM_FIFO0_CH_PTR5_RD_PTR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_PTR_RD_PTR*)0xF01185A4u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_PTR5_RD_PTR.
* To use register names with standard convension, please use GTM_FIFO0_CH_PTR5_RD_PTR.
*/
#define	GTM_FIFO0_CH5_RD_PTR	(GTM_FIFO0_CH_PTR5_RD_PTR)

/** \\brief  185A0, FIFO0 Channel Write Pointer Register */
#define GTM_FIFO0_CH_PTR5_WR_PTR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_PTR_WR_PTR*)0xF01185A0u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_PTR5_WR_PTR.
* To use register names with standard convension, please use GTM_FIFO0_CH_PTR5_WR_PTR.
*/
#define	GTM_FIFO0_CH5_WR_PTR	(GTM_FIFO0_CH_PTR5_WR_PTR)

/** \\brief  185C4, FIFO0 Channel Read Pointer Register */
#define GTM_FIFO0_CH_PTR6_RD_PTR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_PTR_RD_PTR*)0xF01185C4u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_PTR6_RD_PTR.
* To use register names with standard convension, please use GTM_FIFO0_CH_PTR6_RD_PTR.
*/
#define	GTM_FIFO0_CH6_RD_PTR	(GTM_FIFO0_CH_PTR6_RD_PTR)

/** \\brief  185C0, FIFO0 Channel Write Pointer Register */
#define GTM_FIFO0_CH_PTR6_WR_PTR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_PTR_WR_PTR*)0xF01185C0u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_PTR6_WR_PTR.
* To use register names with standard convension, please use GTM_FIFO0_CH_PTR6_WR_PTR.
*/
#define	GTM_FIFO0_CH6_WR_PTR	(GTM_FIFO0_CH_PTR6_WR_PTR)

/** \\brief  185E4, FIFO0 Channel Read Pointer Register */
#define GTM_FIFO0_CH_PTR7_RD_PTR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_PTR_RD_PTR*)0xF01185E4u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_PTR7_RD_PTR.
* To use register names with standard convension, please use GTM_FIFO0_CH_PTR7_RD_PTR.
*/
#define	GTM_FIFO0_CH7_RD_PTR	(GTM_FIFO0_CH_PTR7_RD_PTR)

/** \\brief  185E0, FIFO0 Channel Write Pointer Register */
#define GTM_FIFO0_CH_PTR7_WR_PTR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_PTR_WR_PTR*)0xF01185E0u)

/** Alias (User Manual Name) for GTM_FIFO0_CH_PTR7_WR_PTR.
* To use register names with standard convension, please use GTM_FIFO0_CH_PTR7_WR_PTR.
*/
#define	GTM_FIFO0_CH7_WR_PTR	(GTM_FIFO0_CH_PTR7_WR_PTR)

/** \\brief  600, GTM Infrastructure Interrupt Group */
#define GTM_ICM_IRQG_0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_0*)0xF0100600u)

/** \\brief  604, GTM DPLL Interrupt Group */
#define GTM_ICM_IRQG_1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_1*)0xF0100604u)

/** \\brief  628, ATOM Interrupt Group 1 */
#define GTM_ICM_IRQG_10 /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_10*)0xF0100628u)

/** \\brief  608, TIM Interrupt Group 0 */
#define GTM_ICM_IRQG_2 /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_2*)0xF0100608u)

/** \\brief  610, MCS Interrupt Group 0 */
#define GTM_ICM_IRQG_4 /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_4*)0xF0100610u)

/** \\brief  618, TOM Interrupt Group 0 */
#define GTM_ICM_IRQG_6 /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_6*)0xF0100618u)

/** \\brief  61C, ITOM Interrupt Group 1 */
#define GTM_ICM_IRQG_7 /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_7*)0xF010061Cu)

/** \\brief  624, ATOM Interrupt Group 0 */
#define GTM_ICM_IRQG_9 /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_9*)0xF0100624u)

/** \\brief  9FDA0, CAN Output Select Register */
#define GTM_INOUTSEL_CAN_OUTSEL /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_CAN_OUTSEL*)0xF019FDA0u)

/** Alias (User Manual Name) for GTM_INOUTSEL_CAN_OUTSEL.
* To use register names with standard convension, please use GTM_INOUTSEL_CAN_OUTSEL.
*/
#define	GTM_CANOUTSEL	(GTM_INOUTSEL_CAN_OUTSEL)


/** \\brief  9FD80, DSADC Input Select Register */
#define GTM_INOUTSEL_DSADC_INSEL1 /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_DSADC_INSEL*)0xF019FD80u)

/** Alias (User Manual Name) for GTM_INOUTSEL_DSADC_INSEL1.
* To use register names with standard convension, please use GTM_INOUTSEL_DSADC_INSEL1.
*/
#define	GTM_DSADCINSEL1	(GTM_INOUTSEL_DSADC_INSEL1)

/** \\brief  9FD84, DSADC Input Select Register */
#define GTM_INOUTSEL_DSADC_INSEL2 /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_DSADC_INSEL*)0xF019FD84u)

/** Alias (User Manual Name) for GTM_INOUTSEL_DSADC_INSEL2.
* To use register names with standard convension, please use GTM_INOUTSEL_DSADC_INSEL2.
*/
#define	GTM_DSADCINSEL2	(GTM_INOUTSEL_DSADC_INSEL2)

/** \\brief  9FD88, DSADC Output Select 0 Register */
#define GTM_INOUTSEL_DSADC_OUTSEL00 /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_DSADC_OUTSEL*)0xF019FD88u)

/** Alias (User Manual Name) for GTM_INOUTSEL_DSADC_OUTSEL00.
* To use register names with standard convension, please use GTM_INOUTSEL_DSADC_OUTSEL00.
*/
#define	GTM_DSADCOUTSEL00	(GTM_INOUTSEL_DSADC_OUTSEL00)

/** \\brief  9FD90, DSADC Output Select 1 Register */
#define GTM_INOUTSEL_DSADC_OUTSEL10 /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_DSADC_OUTSEL*)0xF019FD90u)

/** Alias (User Manual Name) for GTM_INOUTSEL_DSADC_OUTSEL10.
* To use register names with standard convension, please use GTM_INOUTSEL_DSADC_OUTSEL10.
*/
#define	GTM_DSADCOUTSEL10	(GTM_INOUTSEL_DSADC_OUTSEL10)

/** \\brief  9FDA4, PSI5 Output Select 0 Register */
#define GTM_INOUTSEL_PSI5_OUTSEL0 /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_PSI5_OUTSEL0*)0xF019FDA4u)

/** Alias (User Manual Name) for GTM_INOUTSEL_PSI5_OUTSEL0.
* To use register names with standard convension, please use GTM_INOUTSEL_PSI5_OUTSEL0.
*/
#define	GTM_PSI5OUTSEL0	(GTM_INOUTSEL_PSI5_OUTSEL0)

/** \\brief  9FDA8, PSI5-S Output Select Register */
#define GTM_INOUTSEL_PSI5S_OUTSEL /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_PSI5S_OUTSEL*)0xF019FDA8u)

/** Alias (User Manual Name) for GTM_INOUTSEL_PSI5S_OUTSEL.
* To use register names with standard convension, please use GTM_INOUTSEL_PSI5S_OUTSEL.
*/
#define	GTM_PSI5SOUTSEL	(GTM_INOUTSEL_PSI5S_OUTSEL)

/** \\brief  9FD30, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL0 /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL*)0xF019FD30u)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL0.
* To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL0.
*/
#define	GTM_TOUTSEL0	(GTM_INOUTSEL_T_OUTSEL0)

/** \\brief  9FD34, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL1 /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL*)0xF019FD34u)

