HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_reg.h
/** \\brief  60010, MCS Channel Program Counter Register 2 */
#define GTM_MCS3_CH0_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0160010u)

/** \\brief  60014, MCS Channel Program Counter Register 3 */
#define GTM_MCS3_CH0_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF0160014u)

/** \\brief  60018, MCS Channel Program Counter Register 4 */
#define GTM_MCS3_CH0_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0160018u)

/** \\brief  6001C, MCS Channel Program Counter Register 5 */
#define GTM_MCS3_CH0_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF016001Cu)

/** \\brief  60020, MCS Channel Program Counter Register 6 */
#define GTM_MCS3_CH0_R6 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6*)0xF0160020u)

/** \\brief  60024, MCS Channel Program Counter Register 7 */
#define GTM_MCS3_CH0_R7 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7*)0xF0160024u)

/** \\brief  600A8, MCS Channel ACB Register */
#define GTM_MCS3_CH1_ACB /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01600A8u)

/** \\brief  60080, MCS Channel Control Register */
#define GTM_MCS3_CH1_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF0160080u)

/** \\brief  600B0, MCS Channel Interrupt Enable Register */
#define GTM_MCS3_CH1_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01600B0u)

/** \\brief  600B4, MCS Channel Software Interrupt Generation Register */
#define GTM_MCS3_CH1_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01600B4u)

/** \\brief  600B8, MCS IRQ Mode Configuration Register */
#define GTM_MCS3_CH1_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01600B8u)

/** \\brief  600AC, MCS Channel interrupt notification register */
#define GTM_MCS3_CH1_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01600ACu)

/** \\brief  60084, MCS Channel Program Counter Register */
#define GTM_MCS3_CH1_PC /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF0160084u)

/** \\brief  60088, MCS Channel Program Counter Register 0 */
#define GTM_MCS3_CH1_R0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0*)0xF0160088u)

/** \\brief  6008C, MCS Channel Program Counter Register 1 */
#define GTM_MCS3_CH1_R1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1*)0xF016008Cu)

/** \\brief  60090, MCS Channel Program Counter Register 2 */
#define GTM_MCS3_CH1_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0160090u)

/** \\brief  60094, MCS Channel Program Counter Register 3 */
#define GTM_MCS3_CH1_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF0160094u)

/** \\brief  60098, MCS Channel Program Counter Register 4 */
#define GTM_MCS3_CH1_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0160098u)

/** \\brief  6009C, MCS Channel Program Counter Register 5 */
#define GTM_MCS3_CH1_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF016009Cu)

/** \\brief  600A0, MCS Channel Program Counter Register 6 */
#define GTM_MCS3_CH1_R6 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6*)0xF01600A0u)

/** \\brief  600A4, MCS Channel Program Counter Register 7 */
#define GTM_MCS3_CH1_R7 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7*)0xF01600A4u)

/** \\brief  60128, MCS Channel ACB Register */
#define GTM_MCS3_CH2_ACB /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF0160128u)

/** \\brief  60100, MCS Channel Control Register */
#define GTM_MCS3_CH2_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF0160100u)

/** \\brief  60130, MCS Channel Interrupt Enable Register */
#define GTM_MCS3_CH2_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF0160130u)

/** \\brief  60134, MCS Channel Software Interrupt Generation Register */
#define GTM_MCS3_CH2_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF0160134u)

/** \\brief  60138, MCS IRQ Mode Configuration Register */
#define GTM_MCS3_CH2_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF0160138u)

/** \\brief  6012C, MCS Channel interrupt notification register */
#define GTM_MCS3_CH2_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF016012Cu)

/** \\brief  60104, MCS Channel Program Counter Register */
#define GTM_MCS3_CH2_PC /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF0160104u)

/** \\brief  60108, MCS Channel Program Counter Register 0 */
#define GTM_MCS3_CH2_R0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0*)0xF0160108u)

/** \\brief  6010C, MCS Channel Program Counter Register 1 */
#define GTM_MCS3_CH2_R1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1*)0xF016010Cu)

/** \\brief  60110, MCS Channel Program Counter Register 2 */
#define GTM_MCS3_CH2_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0160110u)

/** \\brief  60114, MCS Channel Program Counter Register 3 */
#define GTM_MCS3_CH2_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF0160114u)

/** \\brief  60118, MCS Channel Program Counter Register 4 */
#define GTM_MCS3_CH2_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0160118u)

/** \\brief  6011C, MCS Channel Program Counter Register 5 */
#define GTM_MCS3_CH2_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF016011Cu)

/** \\brief  60120, MCS Channel Program Counter Register 6 */
#define GTM_MCS3_CH2_R6 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6*)0xF0160120u)

/** \\brief  60124, MCS Channel Program Counter Register 7 */
#define GTM_MCS3_CH2_R7 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7*)0xF0160124u)

/** \\brief  601A8, MCS Channel ACB Register */
#define GTM_MCS3_CH3_ACB /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01601A8u)

/** \\brief  60180, MCS Channel Control Register */
#define GTM_MCS3_CH3_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF0160180u)

/** \\brief  601B0, MCS Channel Interrupt Enable Register */
#define GTM_MCS3_CH3_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01601B0u)

/** \\brief  601B4, MCS Channel Software Interrupt Generation Register */
#define GTM_MCS3_CH3_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01601B4u)

/** \\brief  601B8, MCS IRQ Mode Configuration Register */
#define GTM_MCS3_CH3_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01601B8u)

/** \\brief  601AC, MCS Channel interrupt notification register */
#define GTM_MCS3_CH3_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01601ACu)

/** \\brief  60184, MCS Channel Program Counter Register */
#define GTM_MCS3_CH3_PC /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF0160184u)

/** \\brief  60188, MCS Channel Program Counter Register 0 */
#define GTM_MCS3_CH3_R0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0*)0xF0160188u)

/** \\brief  6018C, MCS Channel Program Counter Register 1 */
#define GTM_MCS3_CH3_R1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1*)0xF016018Cu)

