HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_reg.h
/** \\brief  60190, MCS Channel Program Counter Register 2 */
#define GTM_MCS3_CH3_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0160190u)

/** \\brief  60194, MCS Channel Program Counter Register 3 */
#define GTM_MCS3_CH3_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF0160194u)

/** \\brief  60198, MCS Channel Program Counter Register 4 */
#define GTM_MCS3_CH3_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0160198u)

/** \\brief  6019C, MCS Channel Program Counter Register 5 */
#define GTM_MCS3_CH3_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF016019Cu)

/** \\brief  601A0, MCS Channel Program Counter Register 6 */
#define GTM_MCS3_CH3_R6 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6*)0xF01601A0u)

/** \\brief  601A4, MCS Channel Program Counter Register 7 */
#define GTM_MCS3_CH3_R7 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7*)0xF01601A4u)

/** \\brief  60228, MCS Channel ACB Register */
#define GTM_MCS3_CH4_ACB /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF0160228u)

/** \\brief  60200, MCS Channel Control Register */
#define GTM_MCS3_CH4_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF0160200u)

/** \\brief  60230, MCS Channel Interrupt Enable Register */
#define GTM_MCS3_CH4_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF0160230u)

/** \\brief  60234, MCS Channel Software Interrupt Generation Register */
#define GTM_MCS3_CH4_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF0160234u)

/** \\brief  60238, MCS IRQ Mode Configuration Register */
#define GTM_MCS3_CH4_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF0160238u)

/** \\brief  6022C, MCS Channel interrupt notification register */
#define GTM_MCS3_CH4_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF016022Cu)

/** \\brief  60204, MCS Channel Program Counter Register */
#define GTM_MCS3_CH4_PC /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF0160204u)

/** \\brief  60208, MCS Channel Program Counter Register 0 */
#define GTM_MCS3_CH4_R0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0*)0xF0160208u)

/** \\brief  6020C, MCS Channel Program Counter Register 1 */
#define GTM_MCS3_CH4_R1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1*)0xF016020Cu)

/** \\brief  60210, MCS Channel Program Counter Register 2 */
#define GTM_MCS3_CH4_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0160210u)

/** \\brief  60214, MCS Channel Program Counter Register 3 */
#define GTM_MCS3_CH4_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF0160214u)

/** \\brief  60218, MCS Channel Program Counter Register 4 */
#define GTM_MCS3_CH4_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0160218u)

/** \\brief  6021C, MCS Channel Program Counter Register 5 */
#define GTM_MCS3_CH4_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF016021Cu)

/** \\brief  60220, MCS Channel Program Counter Register 6 */
#define GTM_MCS3_CH4_R6 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6*)0xF0160220u)

/** \\brief  60224, MCS Channel Program Counter Register 7 */
#define GTM_MCS3_CH4_R7 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7*)0xF0160224u)

/** \\brief  602A8, MCS Channel ACB Register */
#define GTM_MCS3_CH5_ACB /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01602A8u)

/** \\brief  60280, MCS Channel Control Register */
#define GTM_MCS3_CH5_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF0160280u)

/** \\brief  602B0, MCS Channel Interrupt Enable Register */
#define GTM_MCS3_CH5_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01602B0u)

/** \\brief  602B4, MCS Channel Software Interrupt Generation Register */
#define GTM_MCS3_CH5_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01602B4u)

/** \\brief  602B8, MCS IRQ Mode Configuration Register */
#define GTM_MCS3_CH5_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01602B8u)

/** \\brief  602AC, MCS Channel interrupt notification register */
#define GTM_MCS3_CH5_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01602ACu)

/** \\brief  60284, MCS Channel Program Counter Register */
#define GTM_MCS3_CH5_PC /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF0160284u)

/** \\brief  60288, MCS Channel Program Counter Register 0 */
#define GTM_MCS3_CH5_R0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0*)0xF0160288u)

/** \\brief  6028C, MCS Channel Program Counter Register 1 */
#define GTM_MCS3_CH5_R1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1*)0xF016028Cu)

/** \\brief  60290, MCS Channel Program Counter Register 2 */
#define GTM_MCS3_CH5_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0160290u)

/** \\brief  60294, MCS Channel Program Counter Register 3 */
#define GTM_MCS3_CH5_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF0160294u)

/** \\brief  60298, MCS Channel Program Counter Register 4 */
#define GTM_MCS3_CH5_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0160298u)

/** \\brief  6029C, MCS Channel Program Counter Register 5 */
#define GTM_MCS3_CH5_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF016029Cu)

/** \\brief  602A0, MCS Channel Program Counter Register 6 */
#define GTM_MCS3_CH5_R6 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6*)0xF01602A0u)

/** \\brief  602A4, MCS Channel Program Counter Register 7 */
#define GTM_MCS3_CH5_R7 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7*)0xF01602A4u)

/** \\brief  60328, MCS Channel ACB Register */
#define GTM_MCS3_CH6_ACB /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF0160328u)

/** \\brief  60300, MCS Channel Control Register */
#define GTM_MCS3_CH6_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF0160300u)

/** \\brief  60330, MCS Channel Interrupt Enable Register */
#define GTM_MCS3_CH6_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF0160330u)

/** \\brief  60334, MCS Channel Software Interrupt Generation Register */
#define GTM_MCS3_CH6_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF0160334u)

/** \\brief  60338, MCS IRQ Mode Configuration Register */
#define GTM_MCS3_CH6_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF0160338u)

