HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_reg.h
/** \\brief  6032C, MCS Channel interrupt notification register */
#define GTM_MCS3_CH6_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF016032Cu)

/** \\brief  60304, MCS Channel Program Counter Register */
#define GTM_MCS3_CH6_PC /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF0160304u)

/** \\brief  60308, MCS Channel Program Counter Register 0 */
#define GTM_MCS3_CH6_R0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0*)0xF0160308u)

/** \\brief  6030C, MCS Channel Program Counter Register 1 */
#define GTM_MCS3_CH6_R1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1*)0xF016030Cu)

/** \\brief  60310, MCS Channel Program Counter Register 2 */
#define GTM_MCS3_CH6_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0160310u)

/** \\brief  60314, MCS Channel Program Counter Register 3 */
#define GTM_MCS3_CH6_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF0160314u)

/** \\brief  60318, MCS Channel Program Counter Register 4 */
#define GTM_MCS3_CH6_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0160318u)

/** \\brief  6031C, MCS Channel Program Counter Register 5 */
#define GTM_MCS3_CH6_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF016031Cu)

/** \\brief  60320, MCS Channel Program Counter Register 6 */
#define GTM_MCS3_CH6_R6 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6*)0xF0160320u)

/** \\brief  60324, MCS Channel Program Counter Register 7 */
#define GTM_MCS3_CH6_R7 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7*)0xF0160324u)

/** \\brief  603A8, MCS Channel ACB Register */
#define GTM_MCS3_CH7_ACB /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01603A8u)

/** \\brief  60380, MCS Channel Control Register */
#define GTM_MCS3_CH7_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF0160380u)

/** \\brief  603B0, MCS Channel Interrupt Enable Register */
#define GTM_MCS3_CH7_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01603B0u)

/** \\brief  603B4, MCS Channel Software Interrupt Generation Register */
#define GTM_MCS3_CH7_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01603B4u)

/** \\brief  603B8, MCS IRQ Mode Configuration Register */
#define GTM_MCS3_CH7_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01603B8u)

/** \\brief  603AC, MCS Channel interrupt notification register */
#define GTM_MCS3_CH7_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01603ACu)

/** \\brief  60384, MCS Channel Program Counter Register */
#define GTM_MCS3_CH7_PC /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF0160384u)

/** \\brief  60388, MCS Channel Program Counter Register 0 */
#define GTM_MCS3_CH7_R0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0*)0xF0160388u)

/** \\brief  6038C, MCS Channel Program Counter Register 1 */
#define GTM_MCS3_CH7_R1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1*)0xF016038Cu)

/** \\brief  60390, MCS Channel Program Counter Register 2 */
#define GTM_MCS3_CH7_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0160390u)

/** \\brief  60394, MCS Channel Program Counter Register 3 */
#define GTM_MCS3_CH7_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF0160394u)

/** \\brief  60398, MCS Channel Program Counter Register 4 */
#define GTM_MCS3_CH7_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0160398u)

/** \\brief  6039C, MCS Channel Program Counter Register 5 */
#define GTM_MCS3_CH7_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF016039Cu)

/** \\brief  603A0, MCS Channel Program Counter Register 6 */
#define GTM_MCS3_CH7_R6 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6*)0xF01603A0u)

/** \\brief  603A4, MCS Channel Program Counter Register 7 */
#define GTM_MCS3_CH7_R7 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7*)0xF01603A4u)

/** \\brief  60404, MCS Clear Trigger Control Register */
#define GTM_MCS3_CTRG /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CTRG*)0xF0160404u)

/** \\brief  60400, MCS Control Register */
#define GTM_MCS3_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CTRL*)0xF0160400u)

/** \\brief  60410, MCS Error Register */
#define GTM_MCS3_ERR /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_ERR*)0xF0160410u)

/** \\brief  6040C, MCS Channel Reset Register */
#define GTM_MCS3_RST /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_RST*)0xF016040Cu)

/** \\brief  60408, MCS Set Trigger Control Register */
#define GTM_MCS3_STRG /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_STRG*)0xF0160408u)

/** \\brief  184, Monitor Activity Register 0 */
#define GTM_MON_ACTIVITY_0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MON_ACTIVITY_0*)0xF0100184u)

/** \\brief  180, Monitor Status Register */
#define GTM_MON_STATUS /*lint --e(923)*/ (*(volatile Ifx_GTM_MON_STATUS*)0xF0100180u)

/** \\brief  9FF64, MSC Input High Control Register */
#define GTM_MSCIN0_INHCON /*lint --e(923)*/ (*(volatile Ifx_GTM_MSCIN_INHCON*)0xF019FF64u)

/** Alias (User Manual Name) for GTM_MSCIN0_INHCON.
* To use register names with standard convension, please use GTM_MSCIN0_INHCON.
*/
#define	GTM_MSC0INHCON	(GTM_MSCIN0_INHCON)

/** \\brief  9FF60, MSC Input Low Control Register */
#define GTM_MSCIN0_INLCON /*lint --e(923)*/ (*(volatile Ifx_GTM_MSCIN_INLCON*)0xF019FF60u)

/** Alias (User Manual Name) for GTM_MSCIN0_INLCON.
* To use register names with standard convension, please use GTM_MSCIN0_INLCON.
*/
#define	GTM_MSC0INLCON	(GTM_MSCIN0_INLCON)

/** \\brief  9FF6C, MSC Input High Control Register */
#define GTM_MSCIN1_INHCON /*lint --e(923)*/ (*(volatile Ifx_GTM_MSCIN_INHCON*)0xF019FF6Cu)

/** Alias (User Manual Name) for GTM_MSCIN1_INHCON.
* To use register names with standard convension, please use GTM_MSCIN1_INHCON.
*/
#define	GTM_MSC1INHCON	(GTM_MSCIN1_INHCON)

/** \\brief  9FF68, MSC Input Low Control Register */
#define GTM_MSCIN1_INLCON /*lint --e(923)*/ (*(volatile Ifx_GTM_MSCIN_INLCON*)0xF019FF68u)

/** Alias (User Manual Name) for GTM_MSCIN1_INLCON.
* To use register names with standard convension, please use GTM_MSCIN1_INLCON.
*/
#define	GTM_MSC1INLCON	(GTM_MSCIN1_INLCON)

/** \\brief  9FF00, MSC Set Control 0 Register */
#define GTM_MSCSET_1S0_CON0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MSCSET_CON0*)0xF019FF00u)

/** Alias (User Manual Name) for GTM_MSCSET_1S0_CON0.
* To use register names with standard convension, please use GTM_MSCSET_1S0_CON0.
*/
#define	GTM_MSCSET1CON0	(GTM_MSCSET_1S0_CON0)

/** \\brief  9FF04, MSC Set Control 1 Register */
#define GTM_MSCSET_1S0_CON1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MSCSET_CON1*)0xF019FF04u)

