HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_reg.h
/** \\brief  2884, GTM_TIM Channel Filter Parameter 0 Register */
#define GTM_TIM3_CH1_FLT_RE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF0102884u)

/** \\brief  2890, TIM Channel General Purpose 0 Register */
#define GTM_TIM3_CH1_GPR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0102890u)

/** \\brief  2894, TIM Channel General Purpose 1 Register */
#define GTM_TIM3_CH1_GPR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0102894u)

/** \\brief  28A4, TIM Channel Interrupt Enable Register */
#define GTM_TIM3_CH1_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF01028A4u)

/** \\brief  28A8, TIM Channel Software Interrupt Force Register */
#define GTM_TIM3_CH1_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF01028A8u)

/** \\brief  28AC, TIM IRQ Mode Configuration Register */
#define GTM_TIM3_CH1_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF01028ACu)

/** \\brief  28A0, TIM Channel Interrupt Notification Register */
#define GTM_TIM3_CH1_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF01028A0u)

/** \\brief  288C, TIM Channel TDU Control Register */
#define GTM_TIM3_CH1_TDU /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDU*)0xF010288Cu)

/** \\brief  2918, TIM Channel SMU Counter Register */
#define GTM_TIM3_CH2_CNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0102918u)

/** \\brief  291C, TIM Channel SMU Shadow Counter Register */
#define GTM_TIM3_CH2_CNTS /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF010291Cu)

/** \\brief  2900, TIM Channel Control Register */
#define GTM_TIM3_CH2_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0102900u)

/** \\brief  2908, TIM Channel Filter Parameter 1 Register */
#define GTM_TIM3_CH2_FLT_FE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0102908u)

/** \\brief  2904, GTM_TIM Channel Filter Parameter 0 Register */
#define GTM_TIM3_CH2_FLT_RE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF0102904u)

/** \\brief  2910, TIM Channel General Purpose 0 Register */
#define GTM_TIM3_CH2_GPR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0102910u)

/** \\brief  2914, TIM Channel General Purpose 1 Register */
#define GTM_TIM3_CH2_GPR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0102914u)

/** \\brief  2924, TIM Channel Interrupt Enable Register */
#define GTM_TIM3_CH2_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0102924u)

/** \\brief  2928, TIM Channel Software Interrupt Force Register */
#define GTM_TIM3_CH2_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0102928u)

/** \\brief  292C, TIM IRQ Mode Configuration Register */
#define GTM_TIM3_CH2_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF010292Cu)

/** \\brief  2920, TIM Channel Interrupt Notification Register */
#define GTM_TIM3_CH2_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF0102920u)

/** \\brief  290C, TIM Channel TDU Control Register */
#define GTM_TIM3_CH2_TDU /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDU*)0xF010290Cu)

/** \\brief  2998, TIM Channel SMU Counter Register */
#define GTM_TIM3_CH3_CNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0102998u)

/** \\brief  299C, TIM Channel SMU Shadow Counter Register */
#define GTM_TIM3_CH3_CNTS /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF010299Cu)

/** \\brief  2980, TIM Channel Control Register */
#define GTM_TIM3_CH3_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0102980u)

/** \\brief  2988, TIM Channel Filter Parameter 1 Register */
#define GTM_TIM3_CH3_FLT_FE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0102988u)

/** \\brief  2984, GTM_TIM Channel Filter Parameter 0 Register */
#define GTM_TIM3_CH3_FLT_RE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF0102984u)

/** \\brief  2990, TIM Channel General Purpose 0 Register */
#define GTM_TIM3_CH3_GPR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0102990u)

/** \\brief  2994, TIM Channel General Purpose 1 Register */
#define GTM_TIM3_CH3_GPR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0102994u)

/** \\brief  29A4, TIM Channel Interrupt Enable Register */
#define GTM_TIM3_CH3_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF01029A4u)

/** \\brief  29A8, TIM Channel Software Interrupt Force Register */
#define GTM_TIM3_CH3_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF01029A8u)

/** \\brief  29AC, TIM IRQ Mode Configuration Register */
#define GTM_TIM3_CH3_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF01029ACu)

/** \\brief  29A0, TIM Channel Interrupt Notification Register */
#define GTM_TIM3_CH3_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF01029A0u)

/** \\brief  298C, TIM Channel TDU Control Register */
#define GTM_TIM3_CH3_TDU /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDU*)0xF010298Cu)

/** \\brief  2A18, TIM Channel SMU Counter Register */
#define GTM_TIM3_CH4_CNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0102A18u)

/** \\brief  2A1C, TIM Channel SMU Shadow Counter Register */
#define GTM_TIM3_CH4_CNTS /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0102A1Cu)

/** \\brief  2A00, TIM Channel Control Register */
#define GTM_TIM3_CH4_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0102A00u)

/** \\brief  2A08, TIM Channel Filter Parameter 1 Register */
#define GTM_TIM3_CH4_FLT_FE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0102A08u)

/** \\brief  2A04, GTM_TIM Channel Filter Parameter 0 Register */
#define GTM_TIM3_CH4_FLT_RE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF0102A04u)

/** \\brief  2A10, TIM Channel General Purpose 0 Register */
#define GTM_TIM3_CH4_GPR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0102A10u)

/** \\brief  2A14, TIM Channel General Purpose 1 Register */
#define GTM_TIM3_CH4_GPR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0102A14u)

/** \\brief  2A24, TIM Channel Interrupt Enable Register */
#define GTM_TIM3_CH4_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0102A24u)

/** \\brief  2A28, TIM Channel Software Interrupt Force Register */
#define GTM_TIM3_CH4_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0102A28u)

