HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_reg.h
/** \\brief  2A2C, TIM IRQ Mode Configuration Register */
#define GTM_TIM3_CH4_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0102A2Cu)

/** \\brief  2A20, TIM Channel Interrupt Notification Register */
#define GTM_TIM3_CH4_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF0102A20u)

/** \\brief  2A0C, TIM Channel TDU Control Register */
#define GTM_TIM3_CH4_TDU /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDU*)0xF0102A0Cu)

/** \\brief  2A98, TIM Channel SMU Counter Register */
#define GTM_TIM3_CH5_CNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0102A98u)

/** \\brief  2A9C, TIM Channel SMU Shadow Counter Register */
#define GTM_TIM3_CH5_CNTS /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0102A9Cu)

/** \\brief  2A80, TIM Channel Control Register */
#define GTM_TIM3_CH5_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0102A80u)

/** \\brief  2A88, TIM Channel Filter Parameter 1 Register */
#define GTM_TIM3_CH5_FLT_FE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0102A88u)

/** \\brief  2A84, GTM_TIM Channel Filter Parameter 0 Register */
#define GTM_TIM3_CH5_FLT_RE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF0102A84u)

/** \\brief  2A90, TIM Channel General Purpose 0 Register */
#define GTM_TIM3_CH5_GPR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0102A90u)

/** \\brief  2A94, TIM Channel General Purpose 1 Register */
#define GTM_TIM3_CH5_GPR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0102A94u)

/** \\brief  2AA4, TIM Channel Interrupt Enable Register */
#define GTM_TIM3_CH5_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0102AA4u)

/** \\brief  2AA8, TIM Channel Software Interrupt Force Register */
#define GTM_TIM3_CH5_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0102AA8u)

/** \\brief  2AAC, TIM IRQ Mode Configuration Register */
#define GTM_TIM3_CH5_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0102AACu)

/** \\brief  2AA0, TIM Channel Interrupt Notification Register */
#define GTM_TIM3_CH5_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF0102AA0u)

/** \\brief  2A8C, TIM Channel TDU Control Register */
#define GTM_TIM3_CH5_TDU /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDU*)0xF0102A8Cu)

/** \\brief  2B18, TIM Channel SMU Counter Register */
#define GTM_TIM3_CH6_CNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0102B18u)

/** \\brief  2B1C, TIM Channel SMU Shadow Counter Register */
#define GTM_TIM3_CH6_CNTS /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0102B1Cu)

/** \\brief  2B00, TIM Channel Control Register */
#define GTM_TIM3_CH6_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0102B00u)

/** \\brief  2B08, TIM Channel Filter Parameter 1 Register */
#define GTM_TIM3_CH6_FLT_FE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0102B08u)

/** \\brief  2B04, GTM_TIM Channel Filter Parameter 0 Register */
#define GTM_TIM3_CH6_FLT_RE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF0102B04u)

/** \\brief  2B10, TIM Channel General Purpose 0 Register */
#define GTM_TIM3_CH6_GPR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0102B10u)

/** \\brief  2B14, TIM Channel General Purpose 1 Register */
#define GTM_TIM3_CH6_GPR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0102B14u)

/** \\brief  2B24, TIM Channel Interrupt Enable Register */
#define GTM_TIM3_CH6_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0102B24u)

/** \\brief  2B28, TIM Channel Software Interrupt Force Register */
#define GTM_TIM3_CH6_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0102B28u)

/** \\brief  2B2C, TIM IRQ Mode Configuration Register */
#define GTM_TIM3_CH6_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0102B2Cu)

/** \\brief  2B20, TIM Channel Interrupt Notification Register */
#define GTM_TIM3_CH6_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF0102B20u)

/** \\brief  2B0C, TIM Channel TDU Control Register */
#define GTM_TIM3_CH6_TDU /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDU*)0xF0102B0Cu)

/** \\brief  2B98, TIM Channel SMU Counter Register */
#define GTM_TIM3_CH7_CNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0102B98u)

/** \\brief  2B9C, TIM Channel SMU Shadow Counter Register */
#define GTM_TIM3_CH7_CNTS /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0102B9Cu)

/** \\brief  2B80, TIM Channel Control Register */
#define GTM_TIM3_CH7_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0102B80u)

/** \\brief  2B88, TIM Channel Filter Parameter 1 Register */
#define GTM_TIM3_CH7_FLT_FE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0102B88u)

/** \\brief  2B84, GTM_TIM Channel Filter Parameter 0 Register */
#define GTM_TIM3_CH7_FLT_RE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF0102B84u)

/** \\brief  2B90, TIM Channel General Purpose 0 Register */
#define GTM_TIM3_CH7_GPR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0102B90u)

/** \\brief  2B94, TIM Channel General Purpose 1 Register */
#define GTM_TIM3_CH7_GPR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0102B94u)

/** \\brief  2BA4, TIM Channel Interrupt Enable Register */
#define GTM_TIM3_CH7_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0102BA4u)

/** \\brief  2BA8, TIM Channel Software Interrupt Force Register */
#define GTM_TIM3_CH7_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0102BA8u)

/** \\brief  2BAC, TIM IRQ Mode Configuration Register */
#define GTM_TIM3_CH7_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0102BACu)

/** \\brief  2BA0, TIM Channel Interrupt Notification Register */
#define GTM_TIM3_CH7_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF0102BA0u)

/** \\brief  2B8C, TIM Channel TDU Control Register */
#define GTM_TIM3_CH7_TDU /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDU*)0xF0102B8Cu)

