HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_reg.h
/** \\brief  909C, TOM Channel Interrupt Notification Register */
#define GTM_TOM2_CH0_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010909Cu)

/** \\brief  908C, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM2_CH0_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010908Cu)

/** \\brief  9094, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM2_CH0_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109094u)

/** \\brief  9098, TOM Channel Status Register */
#define GTM_TOM2_CH0_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109098u)

/** \\brief  9308, TOM Channel CCU0 Compare Register */
#define GTM_TOM2_CH10_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF0109308u)

/** \\brief  9310, TOM Channel CCU1 Compare Register */
#define GTM_TOM2_CH10_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109310u)

/** \\brief  9304, TOM Channel CCU0 Counter Register */
#define GTM_TOM2_CH10_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109304u)

/** \\brief  9300, TOM Channel Control Register’ */
#define GTM_TOM2_CH10_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109300u)

/** \\brief  9320, TOM Channel Interrupt Enable Register */
#define GTM_TOM2_CH10_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109320u)

/** \\brief  9324, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM2_CH10_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109324u)

/** \\brief  9328, TOM IRQ Mode Configuration Register */
#define GTM_TOM2_CH10_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109328u)

/** \\brief  931C, TOM Channel Interrupt Notification Register */
#define GTM_TOM2_CH10_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010931Cu)

/** \\brief  930C, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM2_CH10_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010930Cu)

/** \\brief  9314, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM2_CH10_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109314u)

/** \\brief  9318, TOM Channel Status Register */
#define GTM_TOM2_CH10_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109318u)

/** \\brief  9348, TOM Channel CCU0 Compare Register */
#define GTM_TOM2_CH11_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF0109348u)

/** \\brief  9350, TOM Channel CCU1 Compare Register */
#define GTM_TOM2_CH11_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109350u)

/** \\brief  9344, TOM Channel CCU0 Counter Register */
#define GTM_TOM2_CH11_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109344u)

/** \\brief  9340, TOM Channel Control Register’ */
#define GTM_TOM2_CH11_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109340u)

/** \\brief  9360, TOM Channel Interrupt Enable Register */
#define GTM_TOM2_CH11_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109360u)

/** \\brief  9364, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM2_CH11_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109364u)

/** \\brief  9368, TOM IRQ Mode Configuration Register */
#define GTM_TOM2_CH11_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109368u)

/** \\brief  935C, TOM Channel Interrupt Notification Register */
#define GTM_TOM2_CH11_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010935Cu)

/** \\brief  934C, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM2_CH11_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010934Cu)

/** \\brief  9354, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM2_CH11_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109354u)

/** \\brief  9358, TOM Channel Status Register */
#define GTM_TOM2_CH11_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109358u)

/** \\brief  9388, TOM Channel CCU0 Compare Register */
#define GTM_TOM2_CH12_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF0109388u)

/** \\brief  9390, TOM Channel CCU1 Compare Register */
#define GTM_TOM2_CH12_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109390u)

/** \\brief  9384, TOM Channel CCU0 Counter Register */
#define GTM_TOM2_CH12_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109384u)

/** \\brief  9380, TOM Channel Control Register’ */
#define GTM_TOM2_CH12_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109380u)

/** \\brief  93A0, TOM Channel Interrupt Enable Register */
#define GTM_TOM2_CH12_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF01093A0u)

/** \\brief  93A4, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM2_CH12_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF01093A4u)

/** \\brief  93A8, TOM IRQ Mode Configuration Register */
#define GTM_TOM2_CH12_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF01093A8u)

/** \\brief  939C, TOM Channel Interrupt Notification Register */
#define GTM_TOM2_CH12_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010939Cu)

/** \\brief  938C, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM2_CH12_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010938Cu)

/** \\brief  9394, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM2_CH12_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109394u)

/** \\brief  9398, TOM Channel Status Register */
#define GTM_TOM2_CH12_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109398u)

/** \\brief  93C8, TOM Channel CCU0 Compare Register */
#define GTM_TOM2_CH13_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF01093C8u)

/** \\brief  93D0, TOM Channel CCU1 Compare Register */
#define GTM_TOM2_CH13_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF01093D0u)

/** \\brief  93C4, TOM Channel CCU0 Counter Register */
#define GTM_TOM2_CH13_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF01093C4u)

/** \\brief  93C0, TOM Channel Control Register’ */
#define GTM_TOM2_CH13_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF01093C0u)

/** \\brief  93E0, TOM Channel Interrupt Enable Register */
#define GTM_TOM2_CH13_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF01093E0u)

