HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_reg.h
/** \\brief  93E4, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM2_CH13_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF01093E4u)

/** \\brief  93E8, TOM IRQ Mode Configuration Register */
#define GTM_TOM2_CH13_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF01093E8u)

/** \\brief  93DC, TOM Channel Interrupt Notification Register */
#define GTM_TOM2_CH13_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF01093DCu)

/** \\brief  93CC, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM2_CH13_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF01093CCu)

/** \\brief  93D4, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM2_CH13_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF01093D4u)

/** \\brief  93D8, TOM Channel Status Register */
#define GTM_TOM2_CH13_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF01093D8u)

/** \\brief  9408, TOM Channel CCU0 Compare Register */
#define GTM_TOM2_CH14_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF0109408u)

/** \\brief  9410, TOM Channel CCU1 Compare Register */
#define GTM_TOM2_CH14_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109410u)

/** \\brief  9404, TOM Channel CCU0 Counter Register */
#define GTM_TOM2_CH14_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109404u)

/** \\brief  9400, TOM Channel Control Register’ */
#define GTM_TOM2_CH14_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109400u)

/** \\brief  9420, TOM Channel Interrupt Enable Register */
#define GTM_TOM2_CH14_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109420u)

/** \\brief  9424, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM2_CH14_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109424u)

/** \\brief  9428, TOM IRQ Mode Configuration Register */
#define GTM_TOM2_CH14_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109428u)

/** \\brief  941C, TOM Channel Interrupt Notification Register */
#define GTM_TOM2_CH14_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010941Cu)

/** \\brief  940C, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM2_CH14_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010940Cu)

/** \\brief  9414, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM2_CH14_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109414u)

/** \\brief  9418, TOM Channel Status Register */
#define GTM_TOM2_CH14_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109418u)

/** \\brief  9448, TOM Channel CCU0 Compare Register */
#define GTM_TOM2_CH15_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH15_CM0*)0xF0109448u)

/** \\brief  9450, TOM Channel CCU1 Compare Register */
#define GTM_TOM2_CH15_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH15_CM1*)0xF0109450u)

/** \\brief  9444, TOM Channel CCU0 Counter Register */
#define GTM_TOM2_CH15_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH15_CN0*)0xF0109444u)

/** \\brief  9440, TOM Channel Control Register */
#define GTM_TOM2_CH15_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH15_CTRL*)0xF0109440u)

/** \\brief  9460, TOM Channel Interrupt Enable Register */
#define GTM_TOM2_CH15_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH15_IRQ_EN*)0xF0109460u)

/** \\brief  9464, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM2_CH15_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH15_IRQ_FORCINT*)0xF0109464u)

/** \\brief  9468, TOM IRQ Mode Configuration Register */
#define GTM_TOM2_CH15_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH15_IRQ_MODE*)0xF0109468u)

/** \\brief  945C, TOM Channel Interrupt Notification Register */
#define GTM_TOM2_CH15_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH15_IRQ_NOTIFY*)0xF010945Cu)

/** \\brief  944C, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM2_CH15_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH15_SR0*)0xF010944Cu)

/** \\brief  9454, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM2_CH15_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH15_SR1*)0xF0109454u)

/** \\brief  9458, TOM Channel Status Register */
#define GTM_TOM2_CH15_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH15_STAT*)0xF0109458u)

/** \\brief  90C8, TOM Channel CCU0 Compare Register */
#define GTM_TOM2_CH1_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF01090C8u)

/** \\brief  90D0, TOM Channel CCU1 Compare Register */
#define GTM_TOM2_CH1_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF01090D0u)

/** \\brief  90C4, TOM Channel CCU0 Counter Register */
#define GTM_TOM2_CH1_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF01090C4u)

/** \\brief  90C0, TOM Channel Control Register’ */
#define GTM_TOM2_CH1_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF01090C0u)

/** \\brief  90E0, TOM Channel Interrupt Enable Register */
#define GTM_TOM2_CH1_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF01090E0u)

/** \\brief  90E4, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM2_CH1_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF01090E4u)

/** \\brief  90E8, TOM IRQ Mode Configuration Register */
#define GTM_TOM2_CH1_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF01090E8u)

/** \\brief  90DC, TOM Channel Interrupt Notification Register */
#define GTM_TOM2_CH1_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF01090DCu)

/** \\brief  90CC, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM2_CH1_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF01090CCu)

/** \\brief  90D4, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM2_CH1_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF01090D4u)

/** \\brief  90D8, TOM Channel Status Register */
#define GTM_TOM2_CH1_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF01090D8u)

/** \\brief  9108, TOM Channel CCU0 Compare Register */
#define GTM_TOM2_CH2_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF0109108u)

