HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_reg.h
/** \\brief  9110, TOM Channel CCU1 Compare Register */
#define GTM_TOM2_CH2_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109110u)

/** \\brief  9104, TOM Channel CCU0 Counter Register */
#define GTM_TOM2_CH2_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109104u)

/** \\brief  9100, TOM Channel Control Register’ */
#define GTM_TOM2_CH2_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109100u)

/** \\brief  9120, TOM Channel Interrupt Enable Register */
#define GTM_TOM2_CH2_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109120u)

/** \\brief  9124, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM2_CH2_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109124u)

/** \\brief  9128, TOM IRQ Mode Configuration Register */
#define GTM_TOM2_CH2_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109128u)

/** \\brief  911C, TOM Channel Interrupt Notification Register */
#define GTM_TOM2_CH2_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010911Cu)

/** \\brief  910C, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM2_CH2_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010910Cu)

/** \\brief  9114, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM2_CH2_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109114u)

/** \\brief  9118, TOM Channel Status Register */
#define GTM_TOM2_CH2_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109118u)

/** \\brief  9148, TOM Channel CCU0 Compare Register */
#define GTM_TOM2_CH3_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF0109148u)

/** \\brief  9150, TOM Channel CCU1 Compare Register */
#define GTM_TOM2_CH3_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109150u)

/** \\brief  9144, TOM Channel CCU0 Counter Register */
#define GTM_TOM2_CH3_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109144u)

/** \\brief  9140, TOM Channel Control Register’ */
#define GTM_TOM2_CH3_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109140u)

/** \\brief  9160, TOM Channel Interrupt Enable Register */
#define GTM_TOM2_CH3_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109160u)

/** \\brief  9164, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM2_CH3_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109164u)

/** \\brief  9168, TOM IRQ Mode Configuration Register */
#define GTM_TOM2_CH3_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109168u)

/** \\brief  915C, TOM Channel Interrupt Notification Register */
#define GTM_TOM2_CH3_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010915Cu)

/** \\brief  914C, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM2_CH3_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010914Cu)

/** \\brief  9154, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM2_CH3_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109154u)

/** \\brief  9158, TOM Channel Status Register */
#define GTM_TOM2_CH3_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109158u)

/** \\brief  9188, TOM Channel CCU0 Compare Register */
#define GTM_TOM2_CH4_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF0109188u)

/** \\brief  9190, TOM Channel CCU1 Compare Register */
#define GTM_TOM2_CH4_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109190u)

/** \\brief  9184, TOM Channel CCU0 Counter Register */
#define GTM_TOM2_CH4_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109184u)

/** \\brief  9180, TOM Channel Control Register’ */
#define GTM_TOM2_CH4_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109180u)

/** \\brief  91A0, TOM Channel Interrupt Enable Register */
#define GTM_TOM2_CH4_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF01091A0u)

/** \\brief  91A4, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM2_CH4_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF01091A4u)

/** \\brief  91A8, TOM IRQ Mode Configuration Register */
#define GTM_TOM2_CH4_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF01091A8u)

/** \\brief  919C, TOM Channel Interrupt Notification Register */
#define GTM_TOM2_CH4_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010919Cu)

/** \\brief  918C, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM2_CH4_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010918Cu)

/** \\brief  9194, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM2_CH4_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109194u)

/** \\brief  9198, TOM Channel Status Register */
#define GTM_TOM2_CH4_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109198u)

/** \\brief  91C8, TOM Channel CCU0 Compare Register */
#define GTM_TOM2_CH5_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF01091C8u)

/** \\brief  91D0, TOM Channel CCU1 Compare Register */
#define GTM_TOM2_CH5_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF01091D0u)

/** \\brief  91C4, TOM Channel CCU0 Counter Register */
#define GTM_TOM2_CH5_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF01091C4u)

/** \\brief  91C0, TOM Channel Control Register’ */
#define GTM_TOM2_CH5_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF01091C0u)

/** \\brief  91E0, TOM Channel Interrupt Enable Register */
#define GTM_TOM2_CH5_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF01091E0u)

/** \\brief  91E4, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM2_CH5_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF01091E4u)

/** \\brief  91E8, TOM IRQ Mode Configuration Register */
#define GTM_TOM2_CH5_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF01091E8u)

/** \\brief  91DC, TOM Channel Interrupt Notification Register */
#define GTM_TOM2_CH5_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF01091DCu)

