HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_reg.h
/** \\brief  91CC, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM2_CH5_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF01091CCu)

/** \\brief  91D4, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM2_CH5_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF01091D4u)

/** \\brief  91D8, TOM Channel Status Register */
#define GTM_TOM2_CH5_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF01091D8u)

/** \\brief  9208, TOM Channel CCU0 Compare Register */
#define GTM_TOM2_CH6_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF0109208u)

/** \\brief  9210, TOM Channel CCU1 Compare Register */
#define GTM_TOM2_CH6_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109210u)

/** \\brief  9204, TOM Channel CCU0 Counter Register */
#define GTM_TOM2_CH6_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109204u)

/** \\brief  9200, TOM Channel Control Register’ */
#define GTM_TOM2_CH6_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109200u)

/** \\brief  9220, TOM Channel Interrupt Enable Register */
#define GTM_TOM2_CH6_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109220u)

/** \\brief  9224, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM2_CH6_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109224u)

/** \\brief  9228, TOM IRQ Mode Configuration Register */
#define GTM_TOM2_CH6_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109228u)

/** \\brief  921C, TOM Channel Interrupt Notification Register */
#define GTM_TOM2_CH6_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010921Cu)

/** \\brief  920C, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM2_CH6_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010920Cu)

/** \\brief  9214, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM2_CH6_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109214u)

/** \\brief  9218, TOM Channel Status Register */
#define GTM_TOM2_CH6_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109218u)

/** \\brief  9248, TOM Channel CCU0 Compare Register */
#define GTM_TOM2_CH7_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF0109248u)

/** \\brief  9250, TOM Channel CCU1 Compare Register */
#define GTM_TOM2_CH7_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109250u)

/** \\brief  9244, TOM Channel CCU0 Counter Register */
#define GTM_TOM2_CH7_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109244u)

/** \\brief  9240, TOM Channel Control Register’ */
#define GTM_TOM2_CH7_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109240u)

/** \\brief  9260, TOM Channel Interrupt Enable Register */
#define GTM_TOM2_CH7_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109260u)

/** \\brief  9264, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM2_CH7_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109264u)

/** \\brief  9268, TOM IRQ Mode Configuration Register */
#define GTM_TOM2_CH7_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109268u)

/** \\brief  925C, TOM Channel Interrupt Notification Register */
#define GTM_TOM2_CH7_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010925Cu)

/** \\brief  924C, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM2_CH7_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010924Cu)

/** \\brief  9254, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM2_CH7_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109254u)

/** \\brief  9258, TOM Channel Status Register */
#define GTM_TOM2_CH7_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109258u)

/** \\brief  9288, TOM Channel CCU0 Compare Register */
#define GTM_TOM2_CH8_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF0109288u)

/** \\brief  9290, TOM Channel CCU1 Compare Register */
#define GTM_TOM2_CH8_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109290u)

/** \\brief  9284, TOM Channel CCU0 Counter Register */
#define GTM_TOM2_CH8_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109284u)

/** \\brief  9280, TOM Channel Control Register’ */
#define GTM_TOM2_CH8_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109280u)

/** \\brief  92A0, TOM Channel Interrupt Enable Register */
#define GTM_TOM2_CH8_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF01092A0u)

/** \\brief  92A4, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM2_CH8_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF01092A4u)

/** \\brief  92A8, TOM IRQ Mode Configuration Register */
#define GTM_TOM2_CH8_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF01092A8u)

/** \\brief  929C, TOM Channel Interrupt Notification Register */
#define GTM_TOM2_CH8_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010929Cu)

/** \\brief  928C, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM2_CH8_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010928Cu)

/** \\brief  9294, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM2_CH8_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109294u)

/** \\brief  9298, TOM Channel Status Register */
#define GTM_TOM2_CH8_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109298u)

/** \\brief  92C8, TOM Channel CCU0 Compare Register */
#define GTM_TOM2_CH9_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF01092C8u)

/** \\brief  92D0, TOM Channel CCU1 Compare Register */
#define GTM_TOM2_CH9_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF01092D0u)

/** \\brief  92C4, TOM Channel CCU0 Counter Register */
#define GTM_TOM2_CH9_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF01092C4u)

/** \\brief  92C0, TOM Channel Control Register’ */
#define GTM_TOM2_CH9_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF01092C0u)

/** \\brief  92E0, TOM Channel Interrupt Enable Register */
#define GTM_TOM2_CH9_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF01092E0u)

/** \\brief  92E4, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM2_CH9_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF01092E4u)

/** \\brief  92E8, TOM IRQ Mode Configuration Register */
#define GTM_TOM2_CH9_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF01092E8u)

