HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_reg.h
/** \\brief  92DC, TOM Channel Interrupt Notification Register */
#define GTM_TOM2_CH9_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF01092DCu)

/** \\brief  92CC, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM2_CH9_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF01092CCu)

/** \\brief  92D4, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM2_CH9_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF01092D4u)

/** \\brief  92D8, TOM Channel Status Register */
#define GTM_TOM2_CH9_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF01092D8u)

/** \\brief  900C, TOM TGC Action Time Base Register */
#define GTM_TOM2_TGC0_ACT_TB /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC_ACT_TB*)0xF010900Cu)

/** \\brief  9004, TOM TGC Enable/Disable Control Register */
#define GTM_TOM2_TGC0_ENDIS_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC_ENDIS_CTRL*)0xF0109004u)

/** \\brief  9008, TOM TGC Enable/Disable Status Register */
#define GTM_TOM2_TGC0_ENDIS_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC_ENDIS_STAT*)0xF0109008u)

/** \\brief  9018, TOM TGC Force Update Control Register */
#define GTM_TOM2_TGC0_FUPD_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC_FUPD_CTRL*)0xF0109018u)

/** \\brief  9000, TOM TGC Global Control Register */
#define GTM_TOM2_TGC0_GLB_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC_GLB_CTRL*)0xF0109000u)

/** \\brief  901C, TOM TGC Internal Trigger Control Register */
#define GTM_TOM2_TGC0_INT_TRIG /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC_INT_TRIG*)0xF010901Cu)

/** \\brief  9010, TOM TGC Output Enable Control Register */
#define GTM_TOM2_TGC0_OUTEN_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC_OUTEN_CTRL*)0xF0109010u)

/** \\brief  9014, TOM TGC Output Enable Status Register */
#define GTM_TOM2_TGC0_OUTEN_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC_OUTEN_STAT*)0xF0109014u)

/** \\brief  904C, TOM TGC Action Time Base Register */
#define GTM_TOM2_TGC1_ACT_TB /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC_ACT_TB*)0xF010904Cu)

/** \\brief  9044, TOM TGC Enable/Disable Control Register */
#define GTM_TOM2_TGC1_ENDIS_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC_ENDIS_CTRL*)0xF0109044u)

/** \\brief  9048, TOM TGC Enable/Disable Status Register */
#define GTM_TOM2_TGC1_ENDIS_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC_ENDIS_STAT*)0xF0109048u)

/** \\brief  9058, TOM TGC Force Update Control Register */
#define GTM_TOM2_TGC1_FUPD_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC_FUPD_CTRL*)0xF0109058u)

/** \\brief  9040, TOM TGC Global Control Register */
#define GTM_TOM2_TGC1_GLB_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC_GLB_CTRL*)0xF0109040u)

/** \\brief  905C, TOM TGC Internal Trigger Control Register */
#define GTM_TOM2_TGC1_INT_TRIG /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC_INT_TRIG*)0xF010905Cu)

/** \\brief  9050, TOM TGC Output Enable Control Register */
#define GTM_TOM2_TGC1_OUTEN_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC_OUTEN_CTRL*)0xF0109050u)

/** \\brief  9054, TOM TGC Output Enable Status Register */
#define GTM_TOM2_TGC1_OUTEN_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC_OUTEN_STAT*)0xF0109054u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXGTM_REG_H */
